{"batchcomplete": "", "query": {"pages": {"1638": {"pageid": 1638, "ns": 0, "title": "Amy Greene", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Amy Greene\n| image = Amy Greene.png\n| name = Amy Greene\n| aliases = Erin Brockovich\n| gender = Female\n| occ = Decorator <small>(for her dad's office)</small> <br> Baby Stylist\n| relatives = [[Leonard Greene]] <small>(father)</small> <br/> [[Sandra Greene]] <small>(mother)</small> <br/> [[Ida Greene]] <small>(paternal grandmother)</small> <br/> [[Rachel Greene]] <small>(sister)</small> <br/> [[Jill Greene]] <small>(sister)</small> <br/> [[Emma Geller-Greene]] <small>(niece)</small>\n| relationships = Myron <small>(Ex-Fiance)</small> <br/> Mark <small>(Ex-Boyfriend)</small>\n| first = \"[[The One With Rachel's Other Sister]]\"\n| last = \"[[The One Where Rachel's Sister Babysits]]\"\n| number = 2\n| actor = [[Christina Applegate]]\n}}'''Amy Greene''' is the sister of [[Rachel Greene|Rachel]] and [[Jill Greene]], and the daughter of [[Leonard Greene|Leonard]] and [[Sandra Greene]]. She was portrayed by [[Christina Applegate]].\n\n== Background ==\nAmy comes to Rachel twice, both times because of boyfriend problems. She repeatedly calls [[Emma Geller-Greene|Emma]], Rachel and [[Ross Geller|Ross]]' daughter, wrongly. She first thought Emma was a boy called Emmett. The next time she appears she keeps calling Emma \"Ella\". The first time she sees the baby, she declares \"You know what would be great? If you guys died!\", thinking she would inherit the baby and her trials and tribulations would be made into a movie (similar to ''Baby Boom'' with Diane Keaton). She is, however, greatly offended when she learns that actually [[Chandler Bing|Chandler]] and [[Monica Geller|Monica]] would get custody of the baby Emma instead. She and Rachel then started fighting when Amy said that Emma was not cute. Chandler sorted them out like a father would do.\n\nHaving later become engaged to the wealthy father of an old boyfriend, she is convinced by Rachel to leave Myron - her fiancee - and try to make a new life on her own, only for this attempt to fall apart when she has Emma's ears pierced while babysitting her. Rachel and Ross flip out and Rachel forces Amy to move out, Amy claiming that she has decided to become a \"baby stylist\", giving fashion advice for infants. Before Amy leaves, Rachel and Amy make up by gossiping about their sister [[Jill Greene|Jill]], who has gotten fat.\n\nDuring her appearances Amy is depicted as being a very unpleasant, abrasive, smart, a little dimwitted, amoral and utterly unlikable person. She displayed a great lack of tact, a poor memory (initially failing to recognize Ross and Monica and subsequently insulting them while describing them) and bossiness, ordering [[Joey Tribbiani|Joey]] around even though in [[Season 10]] she calls him her ''roommate''. She thought that [[Phoebe Buffay|Phoebe]] was Emma and that when she told her real name, Amy thought it was a noise. It is implied that she also steals jewelry; on her first visit, when Rachel learns that Amy is at the door she immediately pleads with Ross \"Hide my rings!\"\n\nAmy also reveals that she used to make out with [[Barry Farber|Barry]] during the time that he and Rachel were together.\n\nAmy is also one of the few women that Joey can't stand, much like he can't stand Janice. At one point, he tells Ross \"She may be the hottest girl I've ever hated.\"\n\nIn a 2019 interview, Christina Applegate thinks Amy will have become highly successful in her career, but would also be childless ([https://www.youtube.com/watch?v=9zEQWuVQDOg source]).\n\n==Trivia==\n* She was shown to have interest in sushi by mentioning it twice in two episodes.\n* In \"[[The One With Rachel's Sister]]\", Phoebe mentions that Amy once bit Rachel, while [[Jill]] is the spoiled one.\n* Both of her appearances as Amy earned Christina Applegate nominations for a Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series, winning the first.\n* Amy moved in with Rachel and Joey in \"[[The One Where Rachel's Sister Baby-Sits]]\" but moved out off-screen.\n* Rachel is the only sister willing to tolerate her.\n* Amy was only originally planned to appear in one episode but due to rumored on-set tension between Reese Witherspoon ([[Jill Greene]]) and Jennifer Aniston four seasons earlier, Christina Applegate was invited to return.\n* Amy at first thought that Ross and Rachel's baby was a boy called Emmet. Later she calls Emma \"Ella\" or \"Emily\". Ross suggests to Rachel they call their next child Ella when Rachel says she likes the name.\n*Amy Greene is similar to Kelly Bundy in Married with Children. \n\n==Appearances==\n* \"[[The One With The Two Parties]]\" <small>(First indirect mention)</small>\n*\"[[The One Without The Ski Trip]]\" <small>(Possible mention)</small>\n* \"[[The One With Rachel's Sister]]\" <small>(First mentioned by name)</small>\n* \"[[The One With The Baby Shower]]\" <small>(Mentioned only)</small>\n* \"[[The One With Rachel's Other Sister]]\" <small>(First appearance)</small>\n* \"[[The One Where Rachel's Sister Babysits]]\"\n[[Category:Friends Characters]]\n[[Category:Recurring Characters]]\n[[Category:Rachel's Family]]\n[[Category:Season 9 Characters]]\n[[Category:Season 10 Characters]]\n[[Category:Aunts]]\n[[Category:Bullying Characters]]\n[[Category:Spoiled Characters]]\n[[Category:Antagonists]]\n[[Category:Females]]\n[[Category:Ross & Monica's Family]]\n[[Category:Characters]]"}}}]}}}}