{"batchcomplete": "", "query": {"pages": {"1522": {"pageid": 1522, "ns": 0, "title": "Barry Farber", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Barry Farber\n| image = BarryFarber.png\n| gender = Male\n| first = [[The One With The Sonogram At The End]]\n| last = [[The One That Could Have Been, Part 2]]\n| occ = Orthodontist\n| number = 6\n| relatives = [[Mindy Hunter-Farber]] <small>(ex-wife)</small><br/> [[Rachel Greene]] (ex-fiancée; wife in The One That Could Have Been part 1 and 2)\n| actor = [[Mitchell Whitfield]]\n| name = Barry Farber\n| relationships = [[Rachel Greene]] <small>(ex-fiancée)</small>\n| aliases = Mr. Potato Head <small>(by Rachel)</small>\n}}\n\n'''Barry Farber, DDS''' was engaged to [[Rachel Greene]], before she left him at the altar. He is an orthodontist. He is portrayed by [[Mitchell Whitfield]].\n\n==History==\nWhile Rachel and Barry were engaged, he was having an affair with [[Mindy Hunter]], Rachel's best friend and maid of honor. After Rachel left him at the altar, he and Mindy went on the honeymoon that he and Rachel would have had in Aruba. Two years later he became engaged to Mindy, but he then cheated on her with Rachel. When Mindy found out from Rachel, the two confronted Barry, however Mindy decided that she would still marry Barry. They divorced in [[Season 6|season six]] after he cheated on her with another woman. \n\nLater on, Rachel's sister [[Amy Greene|Amy]] uncovers her ''making out'' sessions with Barry after Rachel had gone to sleep, while they were engaged, confirming his (and her) unloyal nature. \n\nDuring \"[[The One That Could Have Been, Part 1|The One That Could Have Been]]\", Rachel is married to Barry. When she and [[Joey Tribbiani|Joey]] nearly make out, Joey tells Rachel she is a good wife and she should not cheat on her husband. When she comes home that day, she finds Barry in bed with the dog walker, which probably results in a divorce (not confirmed in the episodes).\n\nIn a 2019 interview, Mitchell Whitfield hopes Barry still has his orthodontist practice following his divorce from Mindy, and is trying to find the right woman for him ([https://www.youtube.com/watch?v=10TLKfakPw4 source]).\n\n==Appearances==\n*\"[[The One With The Sonogram At The End]]\" (First appearance)\n*\"[[The One Where The Monkey Gets Away]]\"\n*\"[[The One With The Evil Orthodontist]]\"\n*\"[[The One With Barry And Mindy's Wedding]]\"\n*\"[[The One That Could Have Been, Part 1]]\"\n*\"[[The One That Could Have Been, Part 2]]\" (Last appearance)\n\n==Trivia==\n*In \"[[The Pilot]]\", his last name was \"Finkle,\" but in all other episodes it was \"Farber.\"\n*As Rachel explains to Monica why she abandoned her wedding, she says that just before running away, she realized \"how much Barry looks like Mr. Potato Head.\"\n*In \"[[The One With Barry and Mindy's Wedding]]\", Barry organized a betting pool on when Rachel would leave the wedding, which could possibly indicate that all the misfortune Rachel suffered during the wedding might had been orchestrated by Barry himself, possibly to get revenge against her for leaving him at the altar when they were going to get married.\n[[Category:Friends Characters]]\n[[Category:Recurring Characters]]\n[[Category:Divorcees]]\n[[Category:Males]]\n[[Category:Rachel's relationships]]\n[[Category:Antagonists]]\n[[Category:Season 1 Characters]]\n[[Category:Season 2 Characters]]\n[[Category:Season 6 Characters]]\n[[Category:Doctors]]\n[[Category:Characters]]"}}}]}}}}