{"batchcomplete": "", "query": {"pages": {"4681": {"pageid": 4681, "ns": 0, "title": "Cassie", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Cassie\n| image = [[File:7x19-Cassie.png|200px]]\n| ep = \"[[The One With Ross And Monica's Cousin]]\"\n| number = 1\n| actor = [[Denise Richards]]\n| name = Cassie\n| gender = Female\n| dob =\n| relatives = [[Jack Geller]] <small>(uncle)</small> <br> [[Judy Geller]] <small>(aunt)</small> <br> [[Aunt Marilyn|Marilyn]] <small>(aunt)</small> <br> [[Ross Geller]] <small>(cousin)</small> <br> [[Monica Geller]] <small>(cousin)</small><br>[[Chandler Bing]] <small>(cousin-in-law)</small> <br> [[Ben Geller]] <small>(first cousin once removed)</small><br> [[Emma Geller-Greene]] <small>(first cousin once removed)</small> <br> [[Jack Bing]] <small>(adoptive first cousin once removed)</small> <br> [[Erica Bing]] <small>(adoptive first cousin once removed)</small>\n| occ = \n}}\n\n'''Cassie''' is [[Monica Geller|Monica]] and [[Ross Geller|Ross]]'s cousin, and the titular character in \"[[The One With Ross And Monica's Cousin]]\". She was portrayed by [[Denise Richards]].\n\nA very beautiful woman, she causes [[Chandler Bing|Chandler]], Ross and [[Phoebe Buffay|Phoebe]] to be attracted to her when she comes to visit, leading to tense situations as they are her fiancé's cousin, cousin and another woman respectively.\n\nThere is no reference to her family name. If Cassie is a daughter of a brother of [[Jack Geller]], her last name is probably \"Geller\". If she is a daughter of Jack's sister or from [[Judy Geller|Judy's]] side of the family, then her last name is very likely different.\n\n==Background==\nWhen she was a child, Cassie used to carry a Barbie everywhere. One summer, her parents along with Jack and Judy rented a beach house with their children. During those holidays, Ross pinned her down and tickled her until she cried. She also got many freckles on her chest.\n\nThe last time she and Ross saw each other was when Cassie was around 7-8 years old. Ross was setting up his tent in line to see ''Return of the Jedi'', but Cassie pretended not to see him out of embarrassment.\n\n==[[Season 7]]==\n\n[[File:Deniserichards.jpg|thumb|left]]\nCassie returns many years later to stay a few days with her cousins before Monica's wedding. Now at 25 years old, she has grown into an incredibly attractive woman with Monica describing her looking exactly like their [[Aunt Marilyn]] Her good looks causes Chandler to be instantly captivated by her when he sees her getting ready to have a lunch with Monica. As he is unable to stop staring at her, Cassie has to stay with Ross.\n\nHowever, the situation repeats as Ross gets shocked at her beauty at the very moment of opening the door, and can't help but stare at her too; though Cassie believes he's just imitating Chandler. They talk about the last time they met and the summer they spent at the beach, while Ross secretly tries to control his desires due to the fact that they are cousins.\n\nThey later sit on the couch to see ''Logan's Run'' and drink wine. Ross mistakenly interprets the romantic atmosphere as a sign that his feelings are reciprocated and tries to kiss Cassie, but she dodges the kiss and in disgust and anger asks him what is he doing. Ross is left speechless by the negative reaction, and after a long and tense silence, he only manages to say that he hasn't had sex in a very long time, which horrifies Cassie and she leaves the sofa.\n\nCassie later stays with Phoebe, but once again, after Phoebe sees her getting out of the shower, she experiences the same attraction that Chandler and Ross felt, and stares at her.\n\n==Trivia==\n*Before Jennifer Aniston was cast as Rachel, Denise Richards was one of the actresses who auditioned for the role. Ironically Ross gets attracted to both Cassie and Rachel. \n*When Denise Richards appeared as Cassie on ''Friends'', she was the girlfriend of [[Charlie Sheen]], who appeared previously in \"[[The One With The Chicken Pox]]\" as [[Phoebe Buffay|Phoebe]]'s occasional date [[Ryan]]. Denise and Charlie were married from 2002-2006.\n**This is ironic because Phoebe ends up getting attracted to both of them.\n[[Category:Season 7 Characters]]\n[[Category:Friends Characters]]\n[[Category:Ross & Monica's Family]]\n[[Category:One Appearance Only]]\n[[Category:Females]]\n[[Category:Characters]]"}}}]}}}}