{"batchcomplete": "", "query": {"pages": {"4996": {"pageid": 4996, "ns": 0, "title": "Cheryl", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Cheryl\n| image = [[File:Cheryl.jpg]]\n| ep = [[The One With The Dirty Girl]]\n| number = 1\n| actor = [[Rebecca Romijn]]\n| name = Cheryl\n| aliases = Dirty girl<br>Beautiful pig <small>(by Joey)</small>\n| gender = Female\n| relationships = [[Ross Geller]] <small>(dated)</small>\n}}\n\n'''Cheryl''' is a doctoral candidate in paleontology who briefly dates [[Ross Geller|Ross]]. She is portrayed by [[Rebecca Romijn]].\n\n== Character ==\nCheryl is a young woman who dates Ross in [[season 4]]. \n\n[[File:Cheryl 2.jpg | thumb | left]]\n\nShe is very attractive, all of Ross' friends are impressed. [[Chandler Bing|Chandler]] thinks she is \"the most beautiful girl ''in the world''\" and [[Monica Geller|Monica]] even exclaims \"did you see the ''ass'' on her?\" In addition, Cheryl shares interests with Ross and has a compatible sense of geeky humor.\n\nWhen Ross first goes to her apartment, to his surprise it is really messy, with clothes, dirty underwear, food scraps and packaging everywhere. He suggests that they go to his apartment, but Cheryl refuses because she doesn't like the smell (which Ross thinks may be the smell of soap and cleanliness).\n\nRoss asks for advice [[Joey Tribbiani|Joey]] who convinces him to try and power through. \n\nWhen Cheryl and Ross start making out on the couch, his hand gets covered in some black goo, then he finds a slice of bologna, then a bag of potato chips starts moving and Ross jumps up and whacks it with a tennis racket and a toilet brush. Cheryl shouts that this is her hamster Mitzi, but then she is relieved that it is just a rat.\n\nThey break up after this scene.\n\nAt the end of the episode, after breaking up with Ross, Cheryl is bemused when [[Monica Geller|Monica]] turns up with cleaning equipment and asks if she can clean the apartment for her, stating that when Ross told her about the mess, she \"couldn't sleep thinking about it\", leading a disgusted Cheryl to close the door on her. Monica then starts cleaning the door.\n[[Category:Friends Characters]]\n[[Category:Season 4 Characters]]\n[[Category:One Appearance Only]]\n[[Category:Ross' relationships]]\n[[Category:Females]]\n[[Category:Characters]]"}}}]}}}}