{"batchcomplete": "", "query": {"pages": {"6580": {"pageid": 6580, "ns": 0, "title": "Clifford Burnett", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Clifford Burnett\n| image = [[File:Clifford Burnett.jpg]]\n| first = [[The One Where Rachel Has A Baby, Part 1]]\n| last = [[The One Where Rachel Has A Baby, Part 2]]\n| number = 2\n| actor = [[Eddie McClintock]]\n| name = Clifford Burnett\n| gender = Male\n| relatives = [[Mrs. Burnett]]† (wife)\n| nickname = Cliff\n| dob = November 16, 1968\n}}\n'''Clifford Burnett''' is a patient with a broken leg who [[Phoebe Buffay|Phoebe]] met in the hospital where [[Rachel Greene|Rachel]] was giving birth. He was portrayed by [[Eddie McClintock]].\n\nPhoebe asked [[Joey Tribbiani|Joey]] to go in and ask him personal questions before she went in to speak to him herself. \n\nOf the information Cliff gave to \"Dr. Drake Ramoray\", Phoebe thought he came off great, and visited him in his hospital room. They have a great time, but once Joey's soap opera ''[[Days of our Lives]]'' (in which he plays the same doctor he impersonated) comes on the television, and Cliff freaks out. Phoebe then, tries to make him feel like he was seeing things, but then Joey barges into the room, in order to tell Phoebe that [[Rachel Greene|Rachel]] is having her baby.\n\nCliff feels betrayed by this, as Phoebe had lied to him, and then made him feel like he was crazy. As Cliff had told Joey some really personal stuff, Joey then decides to tell him some personal stuff about Phoebe:\n*She was married to a gay ice dancer.\n*She gave birth to her brothers triplets.\n*Her twin sister used to do porn.\n\nPhoebe wanted Joey to stop talking about her, because that might freak him out more. However, it was too late and he wanted them to leave.\n\nIn the uncut version, when Cliff heard about Phoebe giving birth to her brother's triplets, he freaked a bit and said \"You and your brother didn't--\" and Phoebe said \"No, no. They implanted embryos.\" and Cliff answered \"Then dinner sounds great.\"\n\n== Trivia ==\n*Born on November 16, 1968.\n*A widower after his wife had a heart attack.\n*33 years old.\n*Not a fan of anything weird sexually.\n[[Category:Friends Characters]]\n[[Category:Season 8 Characters]]\n[[Category:Males]]\n[[Category:Recurring Characters]]\n[[Category:Phoebe's relationships]]\n[[Category:Widowers]]\n[[Category:Characters]]"}}}]}}}}