{"batchcomplete": "", "query": {"pages": {"13712": {"pageid": 13712, "ns": 0, "title": "Dr. Baldharan", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Dr. Baldharan\n| image = Baldharan.jpg\n| gender = male\n| occ = owner of an animal fighting ring\n| ep = \"[[The One With The Fake Monica]]\"\n| number = 1\n| actor = [[Harry Shearer]]\n| seasons = [[Season 1|S1]]\n}}\n'''Dr. Baldharan''' was a man who was heavily implied to be the owner of an animal fighting ring. He met [[Ross Geller|Ross]] very briefly in \"[[The One With The Fake Monica]]\". He was  portrayed by [[Harry Shearer]].\n\nFrom his limited interaction with Ross, Baldharan seemed to be a horrible, compassionless, amoral individual who seemed to have little concern for the animals under his care so long as he could make some money from the smurfing. \n\nWhen [[Marcel]] started humping everything, Ross started looking for a zoo to give him away to, and ended up meeting Baldharan for an interview in [[Central Perk|the coffee shop]]. \n\nThough Ross had no idea that Baldharan's \"zoo\" was an animal fighting ring, Baldharan seemed to think he did know this, confusing him with questions such as if Marcel would fight other animals if cornered and if he was capable of handling a hammer or small blade. \n\n[[Joey Tribbiani|Joey]] and [[Chandler Bing|Chandler]] irritated Baldharan by crassly bursting into the shop with Marcel in order to tell Ross that the monkey had been accepted at San Diego Zoo. Baldharan then promised Ross that he would \"start (Marcel) off against a blind rabbit and give (Ross) twenty percent of the gains.\" \n\nThe scene ends with Ross, Joey and Chandler backing away from Baldharan in horror at his apparently compassionless personality; he was never seen again after that. \n[[Category:Friends Characters]]\n[[Category:Bullying Characters]]\n[[Category:Season 1 Characters]]\n[[Category:One Appearance Only]]\n[[Category:Doctors]]\n[[Category:Antagonists]]\n[[Category:Males]]\n[[Category:Characters]]"}}}]}}}}