{"batchcomplete": "", "query": {"pages": {"1957": {"pageid": 1957, "ns": 0, "title": "Emily Waltham", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Emily Waltham\n| image = EmilyWaltham.png \n| gender = Female\n| first = \"[[The One With Joey's Dirty Day]]\"\n| last = \"[[The One With The Yeti]]\" <small>(on-screen)</small><br>\"[[The One With The Ride Along]]\" <small>(voice)</small>\n| dob = \n| occ = Unknown\n| number = 14\n| relatives = [[Stephen Waltham]] <small>(father)</small> <br> [[Emily Waltham's mother|Mrs. Waltham]] <small>(mother)</small> <br> [[Andrea Waltham]] <small>(stepmother)</small> <br> [[Mr. Waltham]] <small>(paternal uncle)</small> <br> [[Emily Waltham's Cousin|Unnamed paternal cousin]] <br> [[Emily Waltham's second husband|Unnamed husband]] <br> [[Ross Geller]] <small>(ex-husband)</small> <br> [[Ben Geller]] <small>(ex-stepson)</small> <br> [[Jack Geller]] <small>(ex-father-in-law)</small> <br> [[Judy Geller]] <small>(ex-mother-in-law)</small> <br> [[Monica Geller]] <small>(ex-sister-in-law)</small>\n| actor = [[Helen Baxendale]]\n| name = Emily Waltham\n| relationships = [[Emily Waltham's second husband|Unnamed husband]] <br> [[Ross Geller]] <small>(ex-husband)</small> <br> [[Colin]] <small>(ex-boyfriend)</small><br>[[Liam]] <small>(ex-boyfriend)</small>\n| seasons = <s>S1</s> <s>S2</s> <s>S3</s> [[Season 4|S4]] [[Season 5|S5]] <s>S6</s> <s>S7</s> <s>S8</s> <s>S9</s> <s>S10</s>\n}}\n\n'''Emily Waltham''' was the English niece of [[Rachel Greene|Rachel]]'s boss, portrayed by [[Helen Baxendale]].  \n\nEmily begins dating [[Ross Geller|Ross]] at the middle of [[Season 4]]. They quickly fall in love and decide to marry in London, where Emily is from. However, the wedding goes sour when Ross accidentally says Rachel's name instead of Emily's when giving his vows. They get married, but, feeling humiliated, she goes into hiding. During [[Season 5]], she makes occasional appearances, until Ross convinces her to go to New York with him. She accepts, but only on the condition that he will not see Rachel anymore. Ross accepts this condition but tells Emily that the marriage will not work if she cannot trust him, and when she admits she cannot trust him, their marriage ends.\n\n==Biography==\n===Early life===\nEmily was born in [[wikipedia:Shropshire|Shropshire]] to [[Stephen Waltham]] and his first wife. She was dating a man named Colin, until she traveled to [[New York]] and meets with [[Mr. Waltham|her uncle]], who was Rachel's boss.\n\n===Season 4===\nWhen [[Rachel Greene|Rachel]]'s boss asks her to take his niece Emily to the opera on the same night Rachel has her first \"date\" with [[Joshua]], she convinces Ross to go with Emily instead. She and Ross end up in a bed & breakfast in Vermont at the end of the date, and the rest of their relationship is similarly fast-paced. <small>(\"[[The One With Joey's Dirty Day]]\")</small>\n\nWhen Emily leaves to go back to England, Ross catches her at the airport and tell her that he loves her, to which she responds, \"Thank you.\" Later she reveals that she is seeing [[Colin]]. However, she decides to end it with him and admits to Ross that she loves him too. <small>(\"[[The One With The Free Porn]]\")</small>\n\nGreatly bothered by the fact that Emily has to keep traveling back and forth between New York and London, Ross suggests they get married (despite only dating for 6 weeks) Emily is reluctant at first but agrees, and Ross gives a proper proposal. <small>(\"[[The One With All The Haste]]\")</small>\n\nEmily starts planning her wedding and puts her future sister-in-law, Monica Geller in charge of picking up her wedding dress. What Emily didn't know was that while Monica picked up the dress, she wore it and Phoebe and Rachel got their own wedding dresses. <small>(\"[[The One With All The Wedding Dresses]]\")</small>\n\nRachel is very unhappy as she realizes she is still in love with Ross, and decides to tell him at the wedding in London. In London, the building Ross and Emily were going to get married in was starting to be torn down early which lead to a fight between the couple. Ross and Emily almost called off the wedding until Ross made it up to Emily and decorated the half torn down building so he and Emily could still get married. <small>(\"[[The One With Ross' Wedding, Part 1]]\")</small>\n\nDeciding at the last minute not to tell Ross about her feelings, Rachel simply hugs Ross. However, seeing Rachel brings back Ross' old (and true) feelings, and instead of saying, \"I, Ross, take thee, Emily...\", Ross accidentally says, \"I, Ross, take thee, Rachel...\" <small>(\"[[The One With Ross' Wedding, Part 2]]\")</small>\n\n===Season 5===\nThe wedding continues and is finalized. However, feeling humiliated, Emily escapes the wedding party. Trying to save the situation, Ross asks Emily's parents to tell her he would wait for her at the airport, hoping she would still like to go for the honeymoon. After apparently getting stood up by Emily, Ross eventually decides to take Rachel with him instead - only to be seen leaving together by a late-arriving Emily. Emily escapes Ross again and runs into hiding afterwards. <small>(\"[[The One After Ross Says Rachel]]\")</small>\n\nRoss then returns to the US, attempting to reach Emily and persuade her to forgive him over the phone. When she finally calls him, he convinces her to come to New York. She agrees, with the condition that Ross will never see Rachel again. <small>(\"[[The One Where Phoebe Hates PBS]]\")</small>\n\nShe also convinces him to sell all of his furniture that came into any contact with Rachel and move into one of her relatives' apartments. The other five friends agree to support Ross as long as he is happy with being manipulated by Emily, but when Ross expresses his discontent with all the changes he has to make, the group helps him realize that he cannot meet all of Emily's conditions. Ross then tells Emily that their marriage cannot work if she cannot trust him, and as she cannot, their marriage ends. <small>(\"[[The One With The Yeti]]\")</small>\n\nRoss later finds out that Emily is getting married again, and because of this he begins dating [[Janice Litman-Goralnik|Janice]]. The relationship doesn't go far after Janice can't take his whining. <small>(\"[[The One With Chandler's Work Laugh]]\")</small>\n\nLater on Emily calls and leaves a message that she wants to talk to Ross about getting back together even though she is getting married. Rachel convinces Ross not to call her back. <small>(\"[[The One With The Ride-Along]]\")</small>\n\n== Personality ==\nEmily is sweet, smart, supportive and caring when in a positive relationship but she has trouble coping with adversity. She generated trust issues when after what happened at her marriage with Ross. She is forgiving but holds her ground when wronged. \n\n==Relationships==\n===Family===\nEmily is shown to have a good relationship with her father [[Stephen Waltham]]. Her relationship with her stepmother [[Andrea Waltham]] is unknown and nothing is known about her relationship with her birth mother and it's likely she has a good relationship with her uncle [[Mr. Waltham]] and her [[Emily Waltham's cousin|cousin]].\n\n===Ross Geller===\n[[File:RossGeller.jpg|thumb|Ross Geller, her ex-husband]]\nEmily was introduced to [[Ross Geller]] by Rachel when she asked him to take Emily to the opera and this triggered romance. They soon fell in love and decided to get married in London, but then Ross accidentally said Rachel's name and later they ended up getting divorced because she admitted she cannot ever trust him.\n\nDespite that, it appears she kept a soft spot for him, as she later called him to reveal her impending second marriage and offered a chance of reconciliation with him.\n\n===Rachel Greene===\nInitially, Emily was fond of Rachel and was quite good to her. However, after Ross said Rachel's name at his wedding to Emily, Emily started having negative opinions of Rachel and asked Ross to never see or speak to her again, something Ross was completely willing to do. Eventually, Emily realized that she cannot ever trust Ross and she and Ross decided to divorce.\n\n==Trivia==\n* Actress [[Helen Baxendale]] became pregnant between seasons 4 and 5; as a result she was unable to travel to the US to do any filming for [[Season 5]]. Her only appearances were heavily swaddled in bedclothes, and she had to be written out of the series a lot earlier than was intended. Helen Baxendale was asked to reprise the role in Season 10 but turned it down to star in the West End play ''[http://en.wikipedia.org/wiki/After_Miss_Julie After Miss Julie]'', and because she did not want the same level of tabloid attention she received in 1998.\n* Ross and Emily's marriage lasted about two to three months.\n* Also out of Ross' wives, Emily was the only one whom he did not have a child with. (Although Ross and Rachel got drunkenly married then amicably divorced, they had their daughter [[Emma Geller-Greene|Emma]] 3 years after this event and out of wedlock.)\n* No one knows Emily's birth mother's information and whereabouts.\n* Ironically, both the start and the end of Ross' relationship with Emily were done by [[Rachel Greene|Rachel]]: Rachel unintentionally set them up in \"[[The One With Joey's Dirty Day]]\" when she begged Ross take Emily out to the opera so she can meet [[Joshua]] at a party. And when she barged into [[The One With Ross' Wedding: Part 2|their wedding]] out of jealousy, her presence resurfaced Ross' old feelings which distracted him into saying Rachel's name at the altar resulting in Emily running away, avoiding him and ultimately divorcing him in [[The One With The Yeti|a later episode]].\n\n== Appearances ==\n*\"[[The One With Joey's Dirty Day]]\"\n*\"[[The One With All The Rugby]]\"\n*\"[[The One With The Fake Party]]\"\n*\"[[The One With The Free Porn]]\"\n*\"[[The One With Rachel's New Dress]]\"\n*\"[[The One With All The Haste]]\"\n*\"[[The One With All The Wedding Dresses]]\"\n*\"[[The One With The Invitation]]\"\n*\"[[The One With The Worst Best Man Ever]]\"\n*\"[[The One With Ross' Wedding, Part 1]]\"\n*\"[[The One With Ross' Wedding, Part 2]]\"\n*\"[[The One After Ross Says Rachel]]\"\n*\"[[The One With All The Kissing]]\" (Mentioned Only)\n*\"[[The One Where Phoebe Hates PBS]]\"\n*\"[[The One With The Kips]]\" (Mentioned Only)\n*\"[[The One With The Yeti]]\" (Final Physical Appearance)\n*\"[[The One Where Ross Moves In]]\" (Mentioned Only)\n*\"[[The One With Chandler's Work Laugh]]\" (Mentioned Only)\n*\"[[The One With The Ride Along]]\" (Final Voice Appearance)\n*\"[[The One Where Ross Meets Elizabeth's Dad]]\" (Mentioned Only)\n\n[[Category:Recurring Characters]]\n[[Category:Friends Characters]]\n[[Category:Season 4 Characters]]\n[[Category:Season 5 Characters]]\n[[Category:Divorcees]]\n[[Category:Non-Americans]]\n[[Category:English Characters]]\n[[Category:Ross' relationships]]\n[[Category:Females]]\n[[Category:Ross & Monica's Family]]\n[[Category:Antagonists]]\n[[Category:Characters]]"}}}]}}}}