{"batchcomplete": "", "query": {"pages": {"2575": {"pageid": 2575, "ns": 0, "title": "Frances", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Frances\n| ep = \"[[The One With Phoebe's Dad]]\"\n| number = 1\n| actor = [[Audra Lindley]]\n| name = Frances\n| gender = Female\n| relatives = '''Biological'''<br />\n[[Lily Buffay]] <small>(daughter)</small> †<br /><br />\n'''Marital :'''<br />\n[[Frank Buffay Sr.]] <small>(ex-son-in-law)</small><br />\n[[Lily's second husband/Phoebe and Ursula's stepfather|Unnamed son-in-law]]<br />\n[[Duncan]] <small>(ex-grandson-in-law)</small><br />\n[[Mike Hannigan]] <small>(grandson-in-law)</small><br />\nUnnamed husband †<br /><br />\n'''Adoptive :'''<br />\n[[Phoebe Buffay]] <small>(adoptive granddaughter)</small><br />\n[[Ursula Buffay]] <small>(adoptive granddaughter)</small>\n| image = [[File:Frances.jpg|300px]]\n| occ = Cabdriver <small>(formerly)</small>\n}}\n'''Frances''' is the mother of [[Lily Buffay]] and the grandmother of [[Phoebe Buffay|Phoebe]] and [[Ursula Buffay]]. She was thought to be Phoebe's biological grandma, but Phoebe later learns that her birth mother is another woman named [[Phoebe Abbott]].\n\n==History==\nFrances is Phoebe's adoptive grandmother by her adoptive mother Lily. Phoebe shares her apartment with her until her death in [[Season 5]]; she and her grandmother are very close, and Phoebe regularly talks about her with her friends. Frances does not appear to have the same close relationship with her other granddaughter, [[Ursula Buffay|Ursula]], as she was seemingly out of contact with her for long enough to convince Ursula she had died.\n\nHer only physical appearance is in \"[[The One With Phoebe's Dad]]\", where she reveals to Phoebe that the person in the pictures she keeps around the house is not her father. She claims it was Lily's idea to tell her children the picture of the man that came with the frame was of their father, and she just went along with it. She then gives Phoebe her real father's photo and address. At the revelation, Phoebe tries to find her father, [[Frank Buffay Sr.]], but only manages to find [[Mrs. Buffay (Frank Sr.'s second wife)|her father's second wife]] and her half-brother, [[Frank Buffay Jr.|Frank Jr.]], as her father has left them for 4 years.\n\nFrances keeps a framed picture of [[wikipedia:Albert Einstein|Albert Einstein]] in her apartment, whom she has led Phoebe to believe was her grandfather.\n\n===Death===\nIn \"[[The One With Joey's Bag]]\", it is revealed that Frances has passed away. While she was in the market with Phoebe, she, as Phoebe puts it, \"bent down to get some yogurt and she just never came back up\". The last thing Frances said to Phoebe was \"You go get the eggs, I'll get the yogurt and we'll meet at the check out counter\", which Phoebe firmly believes they eventually will. After her death, Phoebe says that although she loved her grandmother and she loved her, she is sure Frances is in Hell.\n\nPhoebe informs Ursula about their grandmother's death, but Ursula declines her invitation to the funeral as she had thought Frances died five years earlier, and has already made peace with it - plus, she has a concert to go to.\n\nAt Frances's funeral, Phoebe meets her long lost father, [[Frank Buffay Sr.]]\n\nPhoebe inherits her grandmother's yellow taxi and apartment. Frances' ashes were kept in a lock box in the cab that [[Joey Tribbiani|Joey]] happened to find on his way to Las Vegas. Phoebe keeps the taxi until the very end of the series. She also lives in the apartment even after her marriage to [[Mike Hannigan|Mike]], although she's forced to live with Monica and Chandler (and briefly with Ross) for the better part of a year after fire damage requires it to be rebuilt.\n\nAt one point in [[Season 7]], [[Monica Geller|Monica]] asks Phoebe for Frances' cookie recipe, which was burned in her apartment fire. It turns out that Frances stole the recipe from Nestle Tollhouse, prompting Phoebe to yell at the ground that this kind of thing is why her grandmother is in Hell.\n[[Category:Friends Characters]]\n[[Category:Phoebe's Family]]\n[[Category:Season 2 Characters]]\n[[Category:Season 5 Characters]]\n[[Category:Mothers]]\n[[Category:Grandmothers]]\n[[Category:Deceased Characters]]\n[[Category:Females]]\n[[Category:Characters]]"}}}]}}}}