{"batchcomplete": "", "query": {"pages": {"2636": {"pageid": 2636, "ns": 0, "title": "Gary Litman", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "\n: ''This article is about Janice's ex-husband. For other characters named Gary see [[Gary (disambiguation)]].''\n\n{{Character\n| character name = Gary Litman\n| image = [[File:Gary mattress king.png|200px]]\n| gender = Male\n| ep = \"[[The One With The Race Car Bed]]\"\n| occ = Mattress salesman\n| number = 1\n| relatives = [[Janice Litman-Goralnik]] <small>(ex-wife)</small><br> Little Miss New-Boobs <small>(wife)</small><br> Unnamed daughter <small>(with Janice)</small> <br> The twins <small>(possible children or step-children)</small>\n| actor = Mark Cohen\n}}\n\n'''Gary Litman''' (also known as '''The Mattress King''') is [[Janice Litman Goralnik]]'s ex-husband.\n==Biography==\n===[[Season 2]]===\nChandler Bing doesn't want his life to end up like Mr. Heckles so he calls his ex-girlfriend Janice. Janice shows up and reveals to be married (to Gary) and is expecting a daughter. <small>(\"[[The One Where Heckles Dies]]\")</small>\n\nChandler Bing is talking to a woman online and she says her husband is having an affair and she wants to meet Chandler. At the end of the episode, it's revealed that Chandler's mystery woman is Janice which means Gary is having an affair. <small>(\"[[The One With Barry And Mindy's Wedding]]\")</small>\n===[[Season 3]]===\n\nThroughout the first part of third season, Janice and Gary are in the process of divorcing and Janice is dating Chandler. Gary and Janice's divorce is almost finalized until Janice and Gary start talking and they start kissing in the park and in the back room at his work. Monica and Joey catch Janice kissing Gary and they tell Chandler who confronts Janice. Janice says she loves both Chandler and Gary but Chandler tells Janice to go back to Gary since they have a daughter together and they should try to make things work. Janice and Chandler break up and Janice and Gary get back together. <small>(\"[[The One With The Race Car Bed]]\")/(\"[[The One With The Giant Poking Device]]\")</small>\n\nLater on, Chandler sees Janice, Gary, and their daughter at the ice skating rink and he's depressed over losing her which leads to him sleeping with one of Joey's sisters. <small>(\"[[The One Where Chandler Can't Remember Which Sister]]\")</small>\n===[[Season 4]]===\nJanice runs into Chandler at the nail salon and Janice reveals that she and Gary have divorced (he most likely cheated on her again) and Janice says that she'll never leave Chandler again. <small>(\"[[The One With All The Rugby]]\")</small>\n===[[Season 8]]===\nAfter Janice has her son and Rachel has her daughter, Janice tells Rachel that she admires her for raising her baby alone. Rachel says that Ross will be there to help out but Janice says that he might be at first but soon he'll move on to his real family. Janice says that her daughter is lucky if she can even spend a weekend with \"her father, the twins, and Little Miss New-Boobs\". <small>(\"[[The One Where Rachel Has A Baby, Part 2]]\")</small>\n\n==Trivia==\n*Despite the multiple mentions, Mark Cohen only appears once as Gary in \"[[The One With The Race Car Bed]]\".\n*In season eight Janice mentions that her daughter barely gets to see \"her father, the twins, and Little Miss New-Boobs\". This indicates that Gary remarried and had twins (or the twins were from his new wife's previous marriage).\n[[Category:Friends Characters]]\n[[Category:Fathers]]\n[[Category:One Appearance Only]]\n[[Category:Divorcees]]\n[[Category:Season 3 Characters]]\n[[Category:Males]]\n[[Category:Characters]]"}}}]}}}}