{"batchcomplete": "", "query": {"pages": {"2609": {"pageid": 2609, "ns": 0, "title": "Gary", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": ": ''This article is about Phoebe's cop boyfriend. For other characters named Gary see [[Gary (disambiguation)]].''\n\n{{Character\n| character name = Gary\n| image = Gary.png\n| gender = Male\n| first = \"[[The One With The Cop]]\"\n| last = \"[[The One With The Ball]]\"\n| occ = Police officer\n| number = 4\n| actor = [[Michael Rapaport]]\n| relationships = [[Phoebe Buffay]] <small>(ex-girlfriend)</small>\n}}\n{{Quote|Phoebe, it’s ok that you feel this way. I mean it is soon. And there’s a lot of things we don’t know about each other, I just figured everything I know about you I really like. And the things I don’t know, I get to learn about it at a place with both our names on the mailbox.|Gary, reassuring Phoebe that she doesn't have to move in with him, if it's too soon for her.}}\n\n'''Gary''' is [[Phoebe Buffay|Phoebe]]'s ex-boyfriend (they were together between \"[[The One With The Cop]]\" and \"[[The One With The Ball]]\", in [[Season 5]]). Gary is a police officer, hence the title of the episode in which he first appears. He was portrayed by [[Michael Rapaport]].\n\nWhen Phoebe first meets Gary, she is running around with a police badge that she has found, using it to defend nature (she threatens to call for backup on one woman for putting her cigarette out on a tree unless she apologizes to the tree). Gary is one of her victims, who she promptly orders to park his car off the pavement, stating that she is a cop. When she learns that Gary is actually a cop, he starts asking her trick questions to prove her occupation, leaving her with no choice but to drop the badge and run away. After tracking her old address ([[Monica's apartment]]), he asks her out on a date - luckily for Phoebe, but also showing his unprofessionalism.\n\nNot much is known about his relationship with Phoebe, but it is mainly based around sex. In \"[[The One With Rachel's Inadvertant Kiss]]\", [[Monica Geller|Monica]] becomes envious of their outrageous sexually. She begins to compete with them by persuading [[Chandler Bing|Chandler]] to have sex with her at every open opportunity. She even follows him into a men's toilet with the intent of getting into his pants.\n\nIn \"[[The One With The Ball]]\", Gary tries to move the relationship with Phoebe forward, and tells Monica that he is going to ask Phoebe to move in with him. Monica, who is seemingly incapable of keeping secrets, reveals it to Phoebe after Gary leaves. Phoebe is shocked because she feels that it is too soon in their relationship, so she asks Chandler (who is famous among his friends for his major commitment issues) to try and put Gary off.\n\nChandler visits Gary at the police station and makes a weak attempt at inflicting his own fears about commitment onto him. Gary disagrees and responds with, \"I was lucky enough to find someone that I really love. I just want to be around her as much as I can.\" Chandler is touched by this and considers moving in with Monica. Gary tells him that it is too soon for them, and Chandler agrees with a smirk. Gary goes ahead and asks Phoebe to move in with him. Phoebe tells him how sweet that she thinks he is but reveals that she thinks that it is really too soon. She can see how upset Gary is, so agrees, even though she does not really want to.\n\nGary, as a cop, works it all out after Phoebe tells him that she cannot find any apartments for them to live in. Phoebe is slightly intimidated by the interrogation, but Gary manages to win her round by telling her how much he likes her and how he wants her to be happy. She then agrees to move in with him happily.\n\nThey only live together for a single day, however, because Gary pokes his gun out of the bedroom window and shoots a bird just because it is chirping too loudly. Phoebe is very disturbed by this and breaks up with him.\n[[Category:Friends Characters]]\n[[Category:Recurring Characters]]\n[[Category:Season 5 Characters]]\n[[Category:Phoebe's relationships]]\n[[Category:Males]]\n[[Category:Characters]]"}}}]}}}}