{"batchcomplete": "", "query": {"pages": {"3205": {"pageid": 3205, "ns": 0, "title": "Gavin Mitchell", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": ": ''For the hospital janitor see [[Gavin]].''\n{{Character\n| character name = Gavin Mitchell\n| image = GavinMitchell.png\n| Caption = \n| first = [[The One Where Rachel Goes Back To Work]]\n| last = [[The One Where Monica Sings]]\n| number = 3\n| actor = [[Dermot Mulroney]]\n| name = Gavin Mitchell\n| nickname = \n| gender = Male\n| occ = [[Ralph Lauren Corporation]] employee <br> Ex-Rodeo clown\n| relatives = Unnamed Mother\n| relationships = [[Rachel Greene]] (kissed; crush)\n}}\n'''Gavin Mitchell''' appears during [[Season 9]] in \"[[The One Where Rachel Goes Back to Work]]\" to \"[[The One Where Monica Sings]]\". He is portrayed by [[Dermot Mulroney]].\n\n==Summary==\nStill on maternity leave, [[Rachel Greene|Rachel]] visits work to find Gavin to have rearranged her office and being favored over her by [[Mr. Zelner|her boss]]. She decides to go back in worrying that she may lose her job to him. At first she finds him very rude but after he offers to look after [[Emma Geller-Greene|Emma]] while she has a presentation, she finds that very kind. In the next episode, she appreciates him for his efforts to look after Emma, but becomes annoyed at his arrogant behavior. Though she tries to take the high road, she is cross when [[Monica Geller|Monica]] invites him to Rachel's birthday party. She asks Monica, who speculates that Gavin is only annoying her just because he may have feelings for her.\n\nHe does come once the party finishes, bringing her a scarf as a present with a card that say simply \"From Gavin.\" When Rachel asks if he has feelings for her, he admits he does. However, when he says he feels she is annoying, Rachel gets annoyed with him again until they engage in a passionate kiss on the balcony which [[Ross Geller|Ross]] sees from his apartment.\n\nWhen Rachel calls in sick from work to avoid Gavin, he visits her at her apartment. When she makes him hide, mistakenly thinking that Ross has come home, he notices that Rachel and Ross' relationship is very complicated and Rachel is still unsure of her feelings, so they decide not to do anything. He is not seen or mentioned again during the show.\n\n[[Category:Friends Characters]]\n[[Category:Recurring Characters]]\n[[Category:Season 9 Characters]]\n[[Category:Rachel's Work]]\n[[Category:Males]]\n[[Category:Rachel's relationships]]\n[[Category:Bullying Characters]]\n[[Category:Characters]]\n[[Category:Former Antagonists]]"}}}]}}}}