{"batchcomplete": "", "query": {"pages": {"2704": {"pageid": 2704, "ns": 0, "title": "Jake", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Jake \n| image = Jake.png\n| gender = Male \n| first = [[The One With Joey's Award]] \n| last = [[The One With Chandler's Dad]] \n| dob = \n| occ = \n| number = 2 \n| relatives = \n| actor = [[Troy Norton]] \n| \n}}\n\n'''Jake''' is [[Phoebe Buffay|Phoebe]]'s boyfriend for part of [[Season 7|season 7]]. He is portrayed by [[Troy Norton]].\n\nDespite showing great affection for Phoebe, Jake is never fundamental to the plot of the series and he is treated much like one of Phoebe's flings.\n\nHowever, in \"[[The One With Joey's Award]]\", Phoebe tricks [[Monica Geller|Monica]] into believing Jake is checking her out. Monica believes it and announces to him that she's engaged, and he states that he just wants to talk to Phoebe, making Monica look like a fool.\n\nIn \"[[The One With Chandler's Dad]]\", Joey starts socializing with Jake. After the two agree to go see the New York Knicks, Jake bends over to take out his diary from his bag, and Joey notices that he's wearing ladies' underwear (they turn out to be Phoebe's). When Joey asks Phoebe about this, she reveals that the panties are hers and that she asked him to wear them. Joey still thinks this is weird, but Phoebe tells him she is wearing Jake's briefs, Joey finds that hot. He argues with Phoebe about Jake's masculinity, and even Joey's. She tells Joey how Jake is secure with his masculinity. Joey is so surprised about this that he tries out one of Rachel's panties for himself, with funny results. He soon becomes insecure about his masculinity and the episode takes off from here.\n\nHe's never seen again after that, and it is never revealed why or when they broke up.\n[[Category:Friends Characters]]\n[[Category:Season 7 Characters]]\n[[Category:Phoebe's relationships]]\n[[Category:Males]]\n[[Category:Recurring Characters]]\n[[Category:Characters]]"}}}]}}}}