{"batchcomplete": "", "query": {"pages": {"3950": {"pageid": 3950, "ns": 0, "title": "Jessica Lockhart", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Jessica\n| image = [[Image:Celia monroe.jpg|300px]]\n| ep = [[The One With Joey's New Brain]]\n| number = 1\n| actor = [[Cecilia Monroe]]<br />[[Susan Sarandon]]\n| name = Jessica Lockhart/Cecilia Monroe\n| gender = Female\n}}\n'''Jessica Lockhart''' is a fictional character on ''[[Days of our Lives]]'', played by the fictional actress [[Cecilia Monroe]] and portrayed by [[Susan Sarandon]]. She's only seen once, when she dies and [[Dr. Drake Ramoray]], played by [[Joey Tribbiani|Joey]], gets her brain, so he can awake from his coma, a procedure Ross takes issue with on medical grounds.\n\nShe was famous for throwing drinks at people and slapping them. Her daughter, named Dina, was seeing a man named Frederick, which she did not approve. She was thrown off a horse and onto an electric fence, an accident set up by Frederick and Dina. After handing over the role of Jessica Lockhart to Joey, Cecilia Munroe slept with Joey causing minor hysteria for Rachel and Monica, who both are big fans of ''Days of our Lives''. \n\nLater scenes exploring Joey's role in the show as Jessica in Drake Ramoray's body. In \"[[The One With Rachel's Date]]\", it is revealed Drake's body is rejecting her brains, and they need to inject fluid from her dead body. Drake is told, however, that Jessica's body is mysteriously missing. \n\n== Trivia ==\n* Cecilia has played \"Jessica\" for many seasons of ''Days of Our Lives''. \n* She had a daughter, Dina, with whom she had a bad relationship. Dina killed her mother to run off with her money and her boyfriend, of whom Jessica didn't approve, who helped execute the murder. \n* Later, however, her body is missing. This suggests she is either still alive (though without a brain), or dug up by Dina and Frederick. \n[[Category:Days of our Lives]]\n[[Category:Friends Characters]]\n[[Category:Season 7 Characters]]\n[[Category:Females]]\n[[Category:In-universe fictional characters]]\n[[Category:One Appearance Only]]\n[[Category:Characters]]"}}}]}}}}