{"batchcomplete": "", "query": {"pages": {"5111": {"pageid": 5111, "ns": 0, "title": "Krista", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{help}}\n\n{{Character\n| character name = Krista\n| image = [[File:FriendsKrista.png|thumb|center|Krista]] \n| ep = [[The One With The Inappropriate Sister]]\n| number = 1\n| actor = [[Julie Lauren]]\n| name = Krista\n| gender = Female\n| relatives = [[Danny]] <small>(brother)</small> \n}}\n\n'''Krista''' is [[Danny]]'s sister, with whom she's abnormally close. She was portrayed by [[Julie Lauren]] in \"[[The One With The Inappropriate Sister]]\".\n\nThe relationship she shares with her brother doesn't really appear to be incestuous, as they don't really appear to be sexually attracted to each other, but it apparently hasn't changed in any way at all since they were children; she still feeds him cake off of her fingers and wipes stains off of his clothes for him, even if the stain in question, from where she has accidentally dropped cake onto his lap, is on the crotch area of his jeans. Danny also still playfully chases his sister around and tickles her even when she's half naked, and they see nothing wrong with still taking their baths ''together;'' it appears as though, bizarrely, they haven't developed any physical intimacy issues upon growing up at all.\n\nAccording to Danny, she and him once climbed a mountain together, and he got annoyed with her when he realized she had forgotten to bring a camera. This reminded [[Joey Tribbiani|Joey]] of when he and [[Chandler Bing|Chandler]] were jogging through a park and saw a \"really pretty bird\" but couldn't take a picture because they didn't have a camera. To the bemusement of [[Rachel Greene|Rachel]], [[Monica Geller|Monica]], Danny and Krista, Chandler responds by saying that \"chasing the Churo guy is not jogging.\"\n[[Category:Season 5 Characters]]\n[[Category:Friends Characters]]\n[[Category:Females]]\n[[Category:One Appearance Only]]\n[[Category:Residents of the Friends building]]\n[[Category:Characters]]"}}}]}}}}