{"batchcomplete": "", "query": {"pages": {"2115": {"pageid": 2115, "ns": 0, "title": "Kristen Leigh", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Kristen Leigh \n| image = [[Image:KristenLeigh.jpg|200px]]\n| gender = Female \n| ep = [[The One With The Cheap Wedding Dress]] \n| actor = [[Gabrielle Union]] \n| \n}}\n'''Kristen Leigh''' appeared \"[[The One With The Cheap Wedding Dress]]\". In the episode, she moves in across the street from [[Central Perk]], from four blocks over. [[Ross Geller|Ross]] and [[Joey Tribbiani|Joey]] both meet her and ask her out. She goes on a date with both of them, unbeknown to them.\n\nWhen they find out, they decide to each take her on one more date and let her decide who she likes better. They set a spending limit of $100. On the night of Ross' date, Joey comes over to wish him good luck. He sees that Ross sent Kristen flowers that cost $100. He smiles at Ross, telling him \"You spent $100. That's the limit. You're screwed!\". But Ross says that he technically didn't break any rules because he sent the flowers before the actual date.\n\nOn the date, Joey appears as an attempt to sabotage Ross. Ross and Joey pretend to not know each other, but get into a verbal fight that reveals very embarrassing personal information about each other (ranging from Ross' three divorces, [[The One Where Underdog Gets Away|to the VD poster Joey appeared on]], to [[Marcel]]). Kristen leaves in the middle of the fight, and Ross and Joey don't notice until she is gone, but don't seem terribly fazed. Instead, they eat dinner with Ross' reservations.\n\n==Trivia==\nKristen's last name isn't given in the credits; it is only heard when both Ross and Joey say it together in the Coffeehouse, and it is clearly \"Leigh\". Audio excerpt played at normal and slower speed:\n[[File:KristenLeigh.mp3]]\nIn the DVD subtitles of the episode, it is also written \"Leigh\". On IMDb (a user-generated website), the character is listed as \"Kristen Lang\".\n\n[[Category:Friends Characters]]\n[[Category:Season 7 Characters]]\n[[Category:Joey's relationships]]\n[[Category:Ross' relationships]]\n[[Category:One Appearance Only]]\n[[Category:Females]]\n[[Category:Characters]]"}}}]}}}}