{"batchcomplete": "", "query": {"pages": {"4851": {"pageid": 4851, "ns": 0, "title": "Luisa Gianetti", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Luisa\n| image = [[image:Luisa.jpg|250px]]\n| ep = [[The One Where The Monkey Gets Away]]\n| number = 1\n| actor = [[Megan Cavanagh]]\n| name = Luisa Gianetti\n| nickname = Luisa from Homeroom\n| gender = Female\n| occ = Animal Control employee\n}}\n\n'''Luisa Gianetti''' is the woman from Animal Control in \"[[The One Where The Monkey Gets Away]]\", portrayed by [[Megan Cavanagh]]. She went to high school together with [[Monica Geller|Monica]] and [[Rachel Greene|Rachel]], but they spent four years ignoring her and they don't get along.\n\n==Character==\nLuisa first appears a few minutes after Rachel calls Animal Control, much to [[Ross Geller|Ross']] dismay. The other friends are present when Luisa steps into Monica's apartment. At first, she does not recognize her former high school \"friends,\" Monica and Rachel. But after they state their names, Luisa introduces herself to them but the girls have no idea who she is, pretending to be surprised. But Luisa realizes this and reveals her feelings to Monica and Rachel, who are quite confused but apologetic for this. Luisa doesn't that much mind Monica (\"you were fat, you had your OWN problems!\"), but then reveals her true dislike for Rachel, stating, \"but you! What a bitch!\" Luisa then walks out, expressing her darker side when she explains that if she finds [[Marcel]] first, he'll be hers to take.\n\nThe gang looks everywhere for Marcel. Monica and [[Phoebe Buffay|Phoebe]], who are working as a team, go down to the cellar and see him. But as they attempt to get him to them, Luisa intrudes on the situation and fires a dart to sedate Marcel. Phoebe intervenes, jumping in front of Marcel and making the dart hit her instead! Marcel legs it and Luisa gives chase. Meanwhile, Phoebe tries to stay awake and succeeds but still goes a bit drowsy, with her senses slightly dulled. Marcel is stolen by [[Mr. Heckles]].\n\nWhile Ross and Mr. Heckles argue over Marcel (or Patty, as named by Heckles), Luisa shows up and traps Marcel in a cage, threatening to have both Ross and Heckles go to court for adopting an exotic animal like Marcel. Rachel tries to resolve things with Luisa as kindly as possible, but Luisa is still unable to overcome her feelings and refuses. Eventually, Rachel has had enough and then says that if she didn't give Marcel back, she would tell Luisa's supervisor that she shot Phoebe \"in the ass with a dart.\" Shocked and defeated, Luisa gives back Marcel. She is not seen ever again after this.\n\n==Appearances==\n\n*\"[[The One Where The Monkey Gets Away]]\"\n\n[[Category:Season 1 Characters]]\n[[Category:Friends Characters]]\n[[Category:One Appearance Only]]\n[[Category:Bullying Characters]]\n[[Category:Antagonists]]\n[[Category:Females]]\n[[Category:Lincoln High School]]\n[[Category:Characters]]"}}}]}}}}