{"batchcomplete": "", "query": {"pages": {"1962": {"pageid": 1962, "ns": 0, "title": "Mark Robinson", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Mark Robinson\n| image = [[File:Mark_Friends.jpg]]\n| first = [[The One Where Chandler Can't Remember Which Sister]]\n| last = [[The One With Princess Consuela]]\n| number = 6\n| actor = [[Steven Eckholdt]]\n| name = Mark Robinson\n| gender = Male\n| occ = Bloomingdale's Executive (formerly) <br> Louis Vuitton Executive\n| relatives = Sibling(s) <br> [[Mrs. Robinson]] (wife) <br> [[Robinson Twins|unnamed twins]] <br> [[Mark Robinson's niece|unnamed niece]]\n| relationships = [[Rachel Greene]] (ex-crush)<br>[[Nancy (Bloomingdale's Employee)|Nancy]] (fling)<br> [[Mrs. Robinson]] (wife)\n| seasons = <s>S1</s> <s>S2</s> [[Season 3|S3]] <s>S4</s> <s>S5</s> <s>S6</s> <s>S7</s> <s>S8</s> <s>S9</s> [[Season 10|S10]]\n}}\n'''Mark Robinson''' was a colleague of [[Rachel Greene|Rachel]] at [[Bloomingdale's]]. He was portrayed by [[Steven Eckholdt]].\n\n==Series Background==\n\nMark Robinson was introduced in [[Season 3]] as a customer at the 50's themed [[Moondance Diner]] where [[Monica Geller|Monica]] was employed. Overhearing a whining conversation between [[Rachel Greene|Rachel]] and Monica, he offers to help Rachel get a job alongside him at Bloomingdale's (Rachel was employed at Fortunata Fashions after quitting her job at Central Perk to pursue her fashion career). [[Ross Geller|Ross]] was jealous of Mark's relationship with Rachel and resentful of him. Mark was always considered as an obstacle to Ross and Rachel's relationship and in \"[[The One With Phoebe's Ex-Partner]]\", although Mark left Bloomingdale's for a better job and was replaced by [[Sophie]], he and Rachel still made plans to hang out at a fashion seminar, causing Ross to volunteer to go in his place to avoid becoming a third wheel. Mark also consoled Rachel at her apartment when she told Ross she wanted to [[The One Where Ross And Rachel Take A Break|take a break from their relationship]], however when Ross called her to make up with her, he overheard Mark in the apartment, causing Ross to end the call and sleep with [[Chloe|someone else]] and Rachel to [[The One With The Morning After|break up with him upon finding out]].\n\n[[File:Rachel_and_jealous_ross.png|thumb|200px|Rachel hugs Mark in front of a jealous Ross in [[The One Where Chandler Can't Remember Which Sister]].]]\n\nA few episodes later, Mark revealed to Rachel that he had always had a crush on her and asked her out. Rachel told him she would think about it, and considered saying no because it was so soon after her break-up with Ross. However, after she gave Ross his stuff back and he annoyed her by demanding more of it, she agreed to go out with Mark and the two went on a date, much to the dismay of Ross, who was still struggling to accept the end of his relationship with Rachel. However Rachel refused to continue a romantic relationship with him when she realized that she was only dating Mark to get back at Ross and did not want to lead him on, so Mark decides to \"get back at Ross with himself\".\n\nWhile Mark initially only appeared in season 3, his reappearance in [[Season 10|season 10]] had a major impact after he catches Rachel and Ross carrying Rachel's possessions out from Ralph Lauren (she was fired for going on an interview with Gucci) and takes Rachel out to dinner for a potential job offer with Louis Vuitton in Paris. Ross doesn't remember him at first, until Rachel reminds him, in which he declares, \"I hate that guy!\" making him jealous again. It was then revealed that Mark is married with twins, calming Ross all of a sudden. Rachel accepted the job offer, but when Ross told her at the airport that he was still in love with her, she got off the plane at the last minute to reunite with Ross, turning down the job offer.\n\n==Relationships==\n===Ross Geller===\n[[Ross Geller]] took an instant dislike to Mark even before meeting him in \"[[The One Where Chandler Can't Remember Which Sister]]\", taking the fact that Mark offered Rachel a job after overhearing her complaining about being unhappy with hers at the Moondance Diner as a sign that he has a crush on her. Although Rachel believes that Ross is being paranoid and over-reacting (which up to a point he admittedly was, after losing Carol to Susan), it later turns out Ross was right- Mark does have a crush on Rachel. Although she was unaware of this while she was in a relationship with Ross and only ever considered her relationship with Mark to be platonic, the paranoid Ross mistakenly suspected she was having an affair with him. In \"[[The One Where Ross and Rachel Take A Break]]\", Mark insists on coming to Rachel's apartment when she calls him, upset after a fight with Ross, and it is Mark's presence at the apartment which causes Ross, overhearing his voice in the background after phoning Rachel and mistakenly thinking he is there to have sex with her, to become convinced that his suspicions about her affair with Mark were right and that his relationship with her is now over, which (after he angrily hangs up) leads to him drunkenly having sex with [[Chloe]].\n\nThe next morning, in \"[[The One With The Morning After]]\", Ross tries to prevent Rachel from learning about his affair with Chloe, but she finds out anyway from Gunther. This results in Ross and Rachel having a fight at her apartment and then breaking up in tears. After the breakup, Ross obviously didn't dislike Mark anymore - but he now hated him. Mark was delighted when he found out and asked Rachel out on a date, making both Gunther and Ross angry in \"[[The One With The Tiny T-Shirt]]\", and Ross has to be talked out of attempting to intervene by Chandler, and is delighted when he later learns Rachel broke up with Mark after realizing she really only agreed to date him to get back at Ross for what he did (and Mark's attitude towards Ross throughout this discussion with Rachel shows that the dislike is mutual.) In \"[[The One With Princess Consuela]]\", Mark returned for the last time in the show where he found Ross and Rachel moving stuff out of her office. After he leaves, Ross seems to consider him a nice guy and asks Rachel if they had met. When Rachel reminds him of who Mark is, however, he gets jealous all over again and even angrily declaring that he hates Mark and not for the first time strongly indicates his feelings for Rachel are still intact when he states that he doesn't want Rachel going to dinner with Mark, but also claims that maybe he'll give her a job as his 'sex-retary', he even tells Rachel he still distrusts him and likely thinking back to the two times Ross and Rachel broke up and the hostility between them after the breakups that went on for a while. When Rachel comes home from dinner, she says that dinner was great and that Mark is so sweet resulting in Ross calling him a smarmy leech but the latter calms down almost instantly when Rachel announces that Mark is married with twins, and, seemingly embarrassed, wonders \"Should we send something?\". His jealousy has apparently dissipated after discovering this. but likely went back to hating him when he learns that he offered Rachel a job in Paris.\n\nAlso, given what had happened in Season 3 between Ross and Rachel: their breakup, them being apart from each other for 7 years and their on-off relationship, and in Season 10: giving Rachel a job in Paris, it is highly likely that Ross will always despise Mark for being responsible for Ross and Rachel's breakup, them being apart for 7 years and everything Ross and Rachel went through for the rest of the show until the [[The Last One, Part 2|last episode]].\n\n===Rachel Greene===\n[[File:MarkRachelKiss.png|thumb|Mark kisses Rachel in \"[[The One With The Tiny T-Shirt]]\"]]\n\nMark was quite friendly with [[Rachel Greene]]. They met at [[Monica Geller|Monica's]] restaurant, [[Moondance Diner]], and he helped her get a job at [[Bloomingdale's]]. They stayed friends after Mark resigned in \"[[The One With Phoebe's Ex-Partner]]\".\n\nA few weeks after Ross and Rachel broke up, Mark admitted being attracted to Rachel and only hiding his feelings because she was in a relationship with Ross. Mark and Rachel went on a date together and he kissed her, but Rachel didn't take things further when she realized she was only doing this to get back at Ross.\n\nSeveral years later in [[season 10]], when Mark offered Rachel a job in Paris, she at first accepted it and then abandoned it, deciding to stay in New York with Ross, thus leaving behind the job Mark acquired for her, symbolizing Mark was never for her.\n\n===Colleagues===\nWhile working at Bloomingdale's, Mark had several other colleagues apart from Rachel, including his ex-boss [[Joanna]], a lady called [[Nancy (Bloomingdale's Employee)|Nancy]] and [[Sophie]]. It's likely that he got on fine with Joanna, while he had a crush on Nancy and made out with her which caused Ross (who was eavesdropping and thinking Mark was trying to seduce Rachel) to break in and push Mark away and throw a love bug at him, because Ross thought Mark was acting romantic to Rachel. It appears Sophie knew Mark, despite her having taken his place as Rachel's deskmate and Joanna's assistant, and she said she loved him.\n\n==Trivia==\n*It is obvious that Mark is not an only child because he was mentioned having a niece in Season 3 and was not married at that time.\n*Given that Mark was confirmed to have a crush on Rachel, maybe Ross had to be a bit jealous.\n*Since Mark was living in Paris as of Season 10, it's possible his wife could be French.\n*Mark was accessory to Ross and Rachel breaking up in Season 3 and to them getting back together in Season 10:\n**Season 3: Mark helped Rachel get a job in fashion. It was the first job ever that Rachel loved and was good at, but was very time-consuming as Rachel had to work late several nights of the week. Ross was insecure, suspicious and jealous of Mark (unjustly), and failed to understand the importance of the job for Rachel. After yet another fight, Rachel asked Ross to \"take a break\" from each other. Later that night, Ross called Rachel to try to work things out, but found out that Mark was in Rachel's apartment. Believing (wrongly) that Rachel would sleep with Mark, Ross slept with [[Chloe]]. This lead to Ross and Rachel's more dramatic actual break up in \"[[The One With The Morning After]]\".\n**Season 10: When Rachel was fired from Ralph Lauren, Mark offered her a job in Paris. Ross bribed Rachel's boss behind her back to give back her job to make her stay in New York. Ross set off to the airport to stop Rachel going to Paris and then she came back to him and they reunited and vowed to remain together for good and never separate ever again.\n\n==Appearances==\n*\"[[The One Where Chandler Can't Remember Which Sister]]\" (First appearance)\n*\"[[The One With All The Jealousy]]\"\n*\"[[The One With Phoebe's Ex-Partner]]\"\n*\"[[The One Where Ross And Rachel Take A Break]]\"\n*\"[[The One With The Morning After]]\" (Mentioned only)\n*\"[[The One Without The Ski Trip]]\" (Mentioned only)\n*\"[[The One With The Tiny T-Shirt]]\"\n*\"[[The One With The Cuffs]]\" (Mentioned only)\n*\"[[The One With Rachel's New Dress]]\" (Mentioned only)\n*\"[[The One With Princess Consuela]]\"\n\n{{Recurring Characters}}\n[[Category:Friends Characters]]\n[[Category:Recurring Characters]]\n[[Category:Season 3 Characters]]\n[[Category:Season 10 Characters]]\n[[Category:Fathers]]\n[[Category:Uncles]]\n[[Category:Rachel's Work]]\n[[Category:Males]]\n[[Category:Rachel's relationships]]\n[[Category:Characters]]\n[[Category:Antagonists]]\n[[Category:Bullying Characters]]"}}}]}}}}