{"batchcomplete": "", "query": {"pages": {"2117": {"pageid": 2117, "ns": 0, "title": "Megan Bailey", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character1\n|character name = Megan Bailey\n|image = [[Image:MeganBailey.jpg|250px]]\n|gender = Female\n|ep = [[The One With The Cheap Wedding Dress]]\n|relatives = unnamed fiancee\n|actor = [[Andrea Bendewald]]\n}}\n\n'''Megan Bailey''' appeared in [[The One With The Cheap Wedding Dress]]. She is a bride-to-be who meets [[Monica Geller|Monica]] in a wedding dress store. She tells Monica how beautiful she looks and they get to talking. Monica tells her about a discount store, Kleinman's, in Brooklyn that is having a 50% off sale soon. While Monica is at Kleinman's looking for her wedding dress (with the assistance of Rachel and Phoebe), she sees Megan again. Only this time she is clutching she same wedding dress that Monica planned on buying. After wrestling her to the ground, Monica manages to escape with the dress.\n\nLater, Megan calls Monica and tells her that she has booked the Swing Kings on the day of Chandler and Monica's wedding and that Monica can't have them unless she gives her the dress.\n\nEventually Monica obliges (after trying to dissuade Chandler from wanting the Swing Kings, but failing) and gives Megan the dress (however Monica told Chandler he could maybe rip the dress a little bit to spite her).\n\n==Trivia==\n*Megan tells Monica that her wedding date is July 25.\n*Megan's fiance wants the heavy metal band, Carcass, to play at their wedding. When [[Phoebe Buffay|Phoebe]] hears this, she exclaims \"Is that spelled with a \"C\" or with a \"K\"? Oh my god, it doesn't matter! They're both great!\"\n*Andrea Bendewald, who is a good friend of Jennifer Aniston was actually a bridesmaid at her wedding in 2000. Aniston was matron of honor at hers in 2001.\n[[Category:Season 7 Characters]]\n[[Category:Friends Characters]]\n[[Category:Bullying Characters]]\n[[Category:One Appearance Only]]\n[[Category:Antagonists]]\n[[Category:Females]]\n[[Category:Characters]]"}}}]}}}}