{"batchcomplete": "", "query": {"pages": {"1788": {"pageid": 1788, "ns": 0, "title": "Mike Hannigan", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Mike Hannigan\n| image = Mike Hannigan.jpeg\n| first = \"[[The One With The Pediatrician]]\"\n| last = \"[[The Last One, Part 2]]\"\n| number = 17\n| actor = [[Paul Rudd]]\n| name = Michael \"Mike\" Hannigan\n| nickname = Crap Bag <small>(\"[[The One With Princess Consuela]]\")</small> <br>Honey <small>(by [[Phoebe Buffay|Phoebe]])</small>\n| gender = Male\n| dob = c. 1966\n| occ = Lawyer <small>(formerly)</small> <br> Pianist\n| relatives = '''Biological''' <br> [[Theodore Hannigan]] <small>(father)</small> <br> [[Bitsy Hannigan]] <small>(mother)</small> <br> [[Mike Hannigan's brother|Unnamed brother]] <br> [[Mike Hannigan's sister|Unnamed sister]]<br><br>\n'''Marital''' <br>[[Phoebe Buffay]] <small>(wife)</small> <br> [[Mike Hannigan's ex-wife|Unnamed ex-wife]] <br> [[Mrs. Buffay (Frank Sr.'s second wife)|Mrs. Buffay]] <small>(stepmother-in-law)</small> <br> [[Lily's second husband/Phoebe and Ursula's stepfather|Unnamed-stepfather-in-law]] <br> [[Frank Buffay Sr.|Frank Buffay]] <small>(father-in-law)</small> <br> [[Phoebe Abbott]] <small>(biological mother-in-law)</small> <br> [[Lily Buffay]] <small>(adoptive mother-in-law)</small> † <br> [[Ursula Buffay]] <small>(sister-in-law)</small> <br> [[Frank Buffay Jr.]] <small>(half-brother-in-law)</small> <br> [[Alice Knight]] <small>(half-sister-in-law)</small> <br> [[Frank Buffay Jr. Jr.]] <small>(half-nephew)</small> <br/> [[Chandler Buffay]] <small>(half-niece)</small> <br/> [[Leslie Buffay]] <small>(half-niece)</small> <br> Unnamed grandmother-in-law <br> [[Frances]] <small>(grandmother-in-law)</small> † <br> Silvia <small>(aunt-in-law)</small><br>[[Mary]] <small>(aunt-in-law)</small>\n| seasons = <s>S1</s> <s>S2</s> <s>S3</s> <s>S4</s> <s>S5</s> <s>S6</s> <s>S7</s> <s>S8</s> [[Season 9|S9]] [[Season 10|S10]]\n}}\n{{CharQuote|Phoebe, I love you. I thought we were apart for a good reason, but then I realized that there was no reason good enough for keeping me from spending the rest of my life with you.|4 = Mike, to Phoebe in Barbados.}}\n\n'''Michael \"Mike\" Hannigan''' is [[Phoebe Buffay|Phoebe]]'s love interest and third husband. He appeared in seventeen episodes of ''[[Friends]]''. He was portrayed by [[Paul Rudd]].\n\n==Background==\n===Introduction of character===\n[[Joey Tribbiani|Joey]] had forgotten to arrange a blind date for [[Phoebe Buffay|Phoebe]], but claimed to have arranged a date with an old friend named Mike, despite not knowing anyone with that name (or many men at all). Joey met Mike by simply walking into [[Central Perk]] and shouting out \"Mike!\", which Mike answers to and agrees to go on a date with Phoebe.\n\n===General===\nOne of the reasons Mike and Phoebe seem to get along so well is the similarities in their personalities and Mike even says in his wedding vows that he loves Phoebe because she is \"so wonderfully weird\". An example of their shared childlike attitude is clear in \"[[The One with Princess Consuela]]\" when Mike changes his name to Crap Bag as a retort to Phoebe's name change. His childishness is also apparent in his and Phoebe's wedding, when he decides that his dog should be one of the groomsmen. We learn from the first time we meet Mike that, like his wife, he is quite musical as he explains (on Joey's poorly arranged blind date) that he recently left his job as an attorney to pursue his dream and ideal career as a pianist, something he wanted to do all his life.\n\n===Family===\nMike first confesses his love for Phoebe in front of his parents, [[Theodore Hannigan|Theodore]] and [[Bitsy Hannigan|Bitsy]], after they voice their concerns about their son's choice of partner in \"[[The One With Ross' Inappropriate Song]]\". We learn in this episode that Mike has come from an upper-class background as his parents live on the upper east side of New York on Park Avenue. On finding this out, Rachel tells Phoebe that she can't be herself and despite spending the whole evening trying to relate to his parents Phoebe does not win their approval due to her quirkiness. However, Mike makes it clear that it is only his parents who live this way when Phoebe walks into the apartment exclaiming \"Oh my God, you're rich!\"\n\n===Phoebe===\n[[Image:PhoebeWedding.jpg|left|thumb|Phoebe and Mike's wedding.]]\nAfter Joey first introduces Mike to Phoebe on the sham of a blind date in \"[[The One With The Pediatrician]]\" a long relationship which temporarily ends when Phoebe learns Mike, having already been through one disastrous marriage, never wants to remarry. Mike then learns that Phoebe's first love, [[David]], is planning to propose to her while they are in Barbados for Ross' key-notes speech; he then changes his mind about marriage and proposes to Phoebe before David can. This proposal was rejected, as Phoebe only wanted to know that marriage was a possibility, and she and Mike become a couple again. They become officially engaged in \"[[The One Where Rachel's Sister Baby-Sits]]\".\n\n[[File:Mike_fake_piano.gif|thumb|200px|Mike's Mad Piano Playing Skills]]\nIn the final season, the two are married in the street outside the Central Perk coffeehouse, with Monica as maid of honor, Rachel as a bridesmaid, Joey officiating (he was ordained over the internet for Monica and Chandler's wedding), Chandler giving Phoebe away and Ross holding Mike's beloved but smelly childhood dog as a groomsman. In the series finale, Mike and Phoebe, after seeing Jack and Erica for the first time, discuss having children. Phoebe says she wants multiple kids by exclaiming; \"One?! How about a whole bunch! Ooh ooh, we teach them to sing and we can be like the Von Trapp Family! Only without the Nazis. Although that sounds kinda dull.\"\n\n===Music===\nIn the time that Mike is with Phoebe his jobs always revolve around his piano playing and his absences in episodes are often explained with \"he's got a gig\". Mike also plays piano at a Karaoke bar in \"[[The One Where Monica Sings]]\".\n\n==Trivia==\n* In \"[[The One In Barbados, Part 2]]\", Mike is portrayed to be an excellent table tennis player. He even quotes 'Oh by the way, I'm awesome.' He is able to quote from the standard table tennis rule book, when Monica commits an infraction by touching the top of the table with her hand. Unfortunately, he commits the same infraction to score the winning point of the second game, but it is never called. In this episode, he is also shown to have a competitive side to him when playing games, similar to that of [[Monica Geller]]. Even so, Chandler still defeats him after Monica gets her right hand hurt.\n* He also appears to have some artistic ability in \"[[The Last One, Part 1]]\". He makes a beautiful banner that reads \"Welcome to the World, Baby Bing\", by which everyone is impressed. Joey is slightly jealous as he has made something in the same vein, but sat in the wet paint.\n* Mike is seen in all four main apartments, Monica's, Phoebe's, Joey's and Ross'.\n\n==Appearances==\n* \"[[The One With The Pediatrician]]\"\n* \"[[The One With The Sharks]]\"\n* \"[[The One With Phoebe's Birthday Dinner]]\" (mentioned only)\n* \"[[The One With The Male Nanny]]\"\n* \"[[The One With Ross' Inappropriate Song]]\"\n* \"[[The One With Rachel's Phone Number]]\"\n* \"[[The One With Phoebe's Rats]]\"\n* \"[[The One Where Monica Sings]]\"\n* \"[[The One With The Boob Job]]\"\n* \"[[The One With The Memorial Service]]\"\n* \"[[The One In Barbados, Part 1]]\"\n* \"[[The One In Barbados, Part 2]]\"\n* \"[[The One After Joey And Rachel Kiss]]\"\n* \"[[The One With Ross' Tan]]\" (mentioned only)\n* \"[[The One Where Rachel's Sister Baby-Sits]]\"\n* \"[[The One With Ross' Grant]]\" (mentioned only)\n* \"[[The One With The Home Study]]\"\n* \"[[The One Where Chandler Gets Caught]]\" (mentioned only)\n* \"[[The One With Phoebe's Wedding]]\"\n* \"[[The One Where Joey Speaks French]]\" (mentioned only)\n* \"[[The One With Princess Consuela]]\"\n* \"[[The Last One, Part 1]]\"\n\n==Reception==\nMike was met with mixed views by fans. Some fans felt that Hannigan was an extraneous character who did not add much to the series, while others felt he added a sense of depth that was somewhat lacking at the time prior to his introduction. He, along with [[Gunther]], is sometimes considered the \"Seventh Friend\".\n\n==References==\n<references />\n[[Category:Friends Characters]]\n[[Category:Recurring Characters]]\n[[Category:Season 9 Characters]]\n[[Category:Season 10 Characters]]\n[[Category:Divorcees]]\n[[Category:Phoebe's Family]]\n[[Category:Phoebe's relationships]]\n[[Category:Males]]\n[[Category:Characters]]\n[[Category:Husbands]]"}}}]}}}}