{"batchcomplete": "", "query": {"pages": {"1802": {"pageid": 1802, "ns": 0, "title": "Mr. Heckles", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Mr. Heckles\n| image = [[Image:Heckles.jpg|250px]]\n| first = [[The One With The Blackout]]\n| last = [[The One Where Heckles Dies]] (physical) <br> [[The One With The Flashback]] (flashback)\n| number = 5\n| actor = [[Larry Hankin]]\n| name = Heckles (Surname)\n| nickname = Old Man Heckles, Mr. Heckles, 'The Weird Man'\n| gender = Male\n| occ = Retired\n}}\n{{CharQuote\n|I could have...\n|4=When complaining about the noise||You owe me a...\nOld catchphrase\n}}\n\n'''Mr. Heckles''' lived in the apartment below [[Monica Geller|Monica]] and [[Rachel Greene|Rachel]] and was portrayed by [[Larry Hankin]].\n\nIn his first appearance, he was credited simply as \"The Weird Man\". He often complained about the apparent noise that the two made, either in person or by tapping on his apartment ceiling with a broom. His complaints were always dismissed as non-genuine as the friends have no recollection of making any noise at all and the fact that Mr. Heckles always tells far-fetched lies. However, while cleaning out his apartment after his death, they discover that in fact any amount of noise, particularly walking, inside Monica and Rachel's apartment is very loud inside his, meaning his complaints were valid the whole time.\n\n==Behavior==\nWhen Mr. Heckles complains to Monica and Rachel (and before that, Monica and [[Phoebe Buffay|Phoebe]]), he usually starts his lines with \"You're doing it again! You're disturbing my...\" followed up with a far-fetched claim such as oboe practice, birds or dinner party. When the girls unsympathetically dismiss his far-fetched allegation, Heckles replies \"I could\" have it, e.g. \"I could play the oboe\". The conversation usually ends at this point, with the women dismissing him, politely or otherwise. In case of the latter, Phoebe responded by saying \"In that case, I'm going to have to ask ''you'' to keep it down!\" and slammed the door in his face.\n\nHeckles told a number of other far-fetched lies as well. When Rachel and Phoebe asked him if [[Paolo's cat]] belonged to him, he lied and claimed that it did. Later in \"[[The One Where The Monkey Gets Away]]\", he claims to have put a waffle outside his apartment door and proclaims \"you owe me a waffle\". In the same episode, he dress the runaway [[Marcel]] like a ballerina, though later insisted that he hadn't seen him. He also once lied about being [[Chandler Bing|Chandler's]] new roommate and even wandered into Chandler's kitchen, both shocking and scaring Chandler in the process. The reason behind his behavior is never revealed, though Rachel theorizes that being a lonely old man, making up those stories was his way of attracting attention.\n\n==Impact==\nDespite being a grumpy old man, Mr. Heckles has majorly impacted the friends, particularly Chandler. During \"[[The One Where Heckles Dies]]\", Mr. Heckles dies while banging on the ceiling after complaining to the six friends about the noise for the last time. Shortly after his death, the friends meet [[Buddy Doyle|his lawyer]], who reveals that since he didn't have any surviving family members, he has left all his worldly possessions to \"the two noisy girls upstairs.\" Exploring his legacy, Chandler looks through Mr. Heckles' diary and is able to draw parallels between his life and Mr. Heckles'. As Chandler discovers, Heckles had refused to commit himself to other people when he was Chandler's age, thus becoming a crabby, grumpy hermit. The similarity in the past and the anticipation of a similar future frightens Chandler, though his friends eventually manage to sooth his phobia by proving that he is not like Mr. Heckles. The episode ends with Chandler bidding \"Goodbye Mr. Heckles...we'll try to keep it down.\"\n\nMr. Heckles appears again in a flashback, where it is revealed that he was the reason [[Joey Tribbiani|Joey]] became Chandler's roommate instead of [[Eric (photographer)|Eric]], a model photographer with a porn star sister. Although Eric made a far better impression than Joey, he encountered Heckles in the hallway, who falsely claimed that he was moving in with Chandler. This effectively left Chandler with no options but living with Joey, though the friendship proved successful in the long run. In addition, had Joey not moved in with Chandler, he never would have been with the friends in London, and Monica never would have gone up to his room to sleep with him, thus Chandler and Monica would have never gotten together, and Joey never would have introduced Phoebe to her future husband, [[Mike Hannigan|Mike Hannigan,]] thus Phoebe never would have got married.\n\n==Appearances==\n* \"[[The One With The Blackout]]\"\n* \"[[The One With Two Parts, Part 1]]\"\n* \"[[The One Where The Monkey Gets Away]]\"\n* \"[[The One Where Heckles Dies]]\"\n* \"[[The One With The Flashback]]\" (flashback)\n[[Category:Friends Characters]]\n[[Category:Recurring Characters]]\n[[Category:Residents of the Friends building]]\n[[Category:Season 1 Characters]]\n[[Category:Season 2 Characters]]\n[[Category:Deceased Characters]]\n[[Category:Bullying Characters]]\n[[Category:Mentally Ill Characters]]\n[[Category:Antagonists]]\n[[Category:A to Z]]\n[[Category:Males]]\n[[Category:Characters]]"}}}]}}}}