{"batchcomplete": "", "query": {"pages": {"1998": {"pageid": 1998, "ns": 0, "title": "Nora Tyler Bing", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Nora Tyler Bing\n| image = Nora-tyler-bing.jpeg\n| gender = Female\n| first = \"[[The One With Mrs. Bing]]\"\n| last = \"[[The One After I Do]]\"\n| dob = \n| occ = Erotic novelist\n| number = 5\n| relatives = '''Biological:'''<br>[[Chandler Bing]] <small>(son)</small> <br> '''Adoptive:''' <br> [[Jack Geller-Bing]] <small>(grandson)</small> <br> [[Erica Geller-Bing]] <small>(granddaughter)</small> <br> '''Marital:''' <br> Three other ex-husbands <br> [[Charles Bing]] <small>(ex-husband)</small> <br> [[Monica Geller]] <small>(daughter-in-law)</small>\n| actor = [[Morgan Fairchild]]\n}}\n\n'''Nora Tyler Bing '''is the mother of [[Chandler Bing]] and ex-wife of [[Charles Bing]], played by [[Morgan Fairchild]]. A graphic adult novelist, she divorced her husband when she learned of his sexuality and his affair with the pool boy when Chandler was very young (Chandler hates Thanksgiving and all Thanksgiving food because they told him they were separating at Thanksgiving dinner). Their divorce triggered Chandler to start using humor as a defense mechanism.\n\nNora Bing is a very successful writer, having sold 100 million copies of her erotic novels. She is an inspiration to [[Rachel Greene|Rachel]] to try writing, she encourages her and advises her \"''You start with half a dozen European cities, throw in 30 euphemisms of male genitalia and bam, you have got yourself a book.''\". Rachel tries to write but the typing mistakes make the friends laugh.\n\nDespite never showing a strong interest in her son's life, proven by the fact that she didn't attend his First Grade Parents Day simply because she \"didn't want to\", Nora clearly loves Chandler, and considers herself a fabulous mother. Granted, her idea of ''good parenting'' is giving him his first condoms, she is also aware of her behavior ''enough'' to show concern that it might have \"screwed him up\". Chandler is understandably embarrassed by her flamboyant and uninhibited behavior, and regrets having found out about her visit from the television instead of by phone. \n\nShe once tried to seduce [[Ross Geller|Ross]]; when Chandler found out, he was, at first, extremely angry with Ross, but this led to him telling Nora how he felt about her and her behavior.\n\nShe appeared again at Chandler's wedding where she came face to face with her ex-husband who was now a drag queen in Las Vegas. At the wedding reception she introduced Chandler to her new boyfriend and Broadway director, Dennis Phillips, much to [[Joey Tribbiani|Joey]]'s delight.\n\n==Casting==\n[[Morgan Fairchild]], who played Chandler's mom, recalls, \"When they first called I thought, 'Oh my God, I'm too young to play this guy's mother.' But I had seen the show and it's such a good show, so I thought it would be fun to do. Then I got on the set and Matthew said, 'You don't remember me but my father is [[John Bennett Perry]] and I used to visit you on the set of Flamingo Road.' His dad played the sheriff on Flamingo Road and also was on Falcon Crest. So then I started thinking, maybe I ''am'' old enough to play his mother.\"\n\nFairchild is 19 years older than Matthew Perry.\n\n==Appearances==\n*\"[[The One With Mrs. Bing]]\" (First appearance)\n*\"[[The One With The Princess Leia Fantasy]]\" (Mentioned only)\n*\"[[The One Without The Ski Trip]]\" (Mentioned only)\n*\"[[The One With All The Thanksgivings]]\" (Appears in flashback)\n*\"[[The One With Rachel's Big Kiss]] (Mentioned only)\n*\"[[The One With Monica And Chandler's Wedding, Part 1]]\"\n*\"[[The One With Monica And Chandler's Wedding, Part 2]]\"\n*\"[[The One After \"I Do\"]]\"\n[[Category:Recurring Characters]]\n[[Category:Chandler's Family]]\n[[Category:Friends Characters]]\n[[Category:Mothers]]\n[[Category:Grandmothers]]\n[[Category:Divorcees]]\n[[Category:Ross' relationships]]\n[[Category:Season 1 Characters]]\n[[Category:Season 5 Characters]]\n[[Category:Season 8 Characters]]\n[[Category:Females]]\n[[Category:Characters]]\n[[Category:Ross & Monica's Family]]"}}}]}}}}