{"batchcomplete": "", "query": {"pages": {"1993": {"pageid": 1993, "ns": 0, "title": "Phoebe Abbott", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Phoebe Abbott\n| image = [[Image:Phoebe Abbott.jpg|300px]]\n| gender = Female\n| first = \"[[The One At The Beach]]\"\n| last = \"[[The One With Phoebe's Uterus]]\"\n| dob = \n| occ = Real Estate Agent <br> Artist\n| number = 3\n| relatives = '''Biological'''<br>[[Phoebe Buffay]] <small>(daughter)</small><br>[[Ursula Buffay]] <small>(daughter)</small><br>Unnamed mother<br><br>'''Marital'''<br>[[Mike Hannigan]] <small>(son-in-law)</small><br>[[Duncan|Duncan Sullivan]] <small>(ex-son-in-law)</small>\n| actor = [[Teri Garr]]\n| relationships = [[Frank Buffay]] <small>(ex-boyfriend)</small><br>[[Lily Buffay]] (<small>ex-girlfriend)</small>\n}}\n\n'''Phoebe Abbott''' is [[Phoebe Buffay|Phoebe]] and [[Ursula Buffay]]'s birth mother. She was portrayed by [[Teri Garr]].\n\n==Character==\nWhen she is introduced, Phoebe Abbott displays many character traits similar to her daughter, Phoebe Buffay. Abbott is somewhat eccentric, enthusiastic, dreamy and a bit in her own world. She works as a real estate agent, but her true passion lies in erotica and pottery, which she has combined as her artistic expression (which Phoebe Buffay dubs 'erottery'). She is at first unwilling to face the consequences of her choice to give up Phoebe and Ursula, but eventually deals with it and attempts to build a connection with her daughter. Ursula, being Ursula, has known about Phoebe Abbott for years, yet never bothered to mention it to her twin sister.\n\n== History ==\nPhoebe Abbott is Phoebe Buffay's birth mother. As it turns out, [[Frank Buffay]], [[Lily Buffay|Lily]], and Phoebe were all in a sexual relationship which led to Phoebe becoming pregnant. After giving birth to the twins, Phoebe left and Frank and Lily married and raised the twins on their own before Frank divorced Lily and left.\n\n== Series arc ==\nShe is first introduced when Phoebe Buffay finds out that this woman knew her parents. Chandler, Joey, Ross, Monica, and Rachel head to a beach house to stay while Phoebe visits someone whom she thinks is a friend of her mother's. When Phoebe visits Phoebe Abbott, she starts questioning her about her parents and what they were like. Phoebe Abbott lies to Phoebe Buffay, but she soon realizes she's lying. When the truth comes out that Phoebe Abbott is in fact Phoebe Buffay's birth mother, the two Phoebes build up a relationship.\n\nHer last appearance is when Phoebe Buffay is having trouble deciding whether or not to be a surrogate for her brother Frank Jr. and his wife Alice. Phoebe Abbott loans her daughter a puppy to look after and see how hard it is to give up the puppy. This does not go to plan and Phoebe Buffay ends up giving the puppy to Frank Jr. and Alice. She then agrees to be the surrogate because she saw how happy the puppy made Frank Jr. and Alice.\n\nAfter this appearance, the two Phoebes remain in contact with each other. In \"[[The One Hundredth]]\", when Phoebe Buffay is going into labor, Phoebe Abbott calls her asking a question about the birth, and as Phoebe Buffay doesn't know the answer, she asks her friends for the answer. Later in \"[[The One With The Yeti]]\", Phoebe Abbott sends Phoebe Buffay a fur coat heirloom that belonged to her birth grandmother. Later, in \"[[The One With Phoebe's Wedding]]\", it is revealed that Phoebe Abbott is unable to come to Phoebe Buffay's wedding.\n\nFrank and Lily named Phoebe after her birth mother.\n\n==Trivia==\n*Phoebe is [[Phoebe Buffay]] and [[Ursula Buffay]]'s biological mother.\n*Frank and Lily named Phoebe after her.\n*She is bisexual, due to her relationship with Frank and Lily. \n\n{{Recurring Characters}}\n[[Category:Recurring Characters]]\n[[Category:Phoebe's Family]]\n[[Category:Friends Characters]]\n[[Category:Season 3 Characters]]\n[[Category:Season 4 Characters]]\n[[Category:Mothers]]\n[[Category:Females]]\n[[Category:LGBT Characters]]\n[[Category:Characters]]"}}}]}}}}