{"batchcomplete": "", "query": {"pages": {"4900": {"pageid": 4900, "ns": 0, "title": "Ryan", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Ryan\n| image = Ryan.png\n| ep = [[The One With The Chicken Pox]]\n| number = 1\n| actor = [[Charlie Sheen]]\n| name = Ryan\n| gender = Male\n| occ = Lieutenant Commander, United States Navy\n| relationships = [[Phoebe Buffay]] (dated)\n}}\n'''Ryan''' is a man that [[Phoebe Buffay|Phoebe]] used to go out with, portrayed by [[Charlie Sheen]]. He is a Lieutenant Commander in the United States Navy and spends most of his life underwater. He usually visits Phoebe for three days at a time, then returns to the submarine. For this reason Phoebe calls him \"my 'submarine guy'\".\n\n==Background==\n===Early Life===\nRyan and Phoebe met some time before the start of the series while Phoebe was playing guitar in Washington Square Park, and Ryan gave her some salt water taffy because he didn't have any change. They began to date but they could only see each other for three days every couple of years while Ryan was on leave.\n\n===[[Season 2]]===\nRyan returned during another of his breaks in service, this time for two weeks, and Phoebe made plans to spend the time with him. Unfortunately, she got chicken pox from [[Ben Geller|Ben]] and her plans were ruined. Ryan was bemused when he, upon walking into [[Monica Geller|Monica]]'s apartment, saw Phoebe with her head covered with a scarf, trying to prevent him from seeing that she had caught chicken pox. When he eventually convinced her to let him see her face, lightning from a storm raging outside flashed and scared Ryan, causing Phoebe to mistakenly think he was scared by her appearance. When trying to convince her that it was the lightning that had scared him and that it was an unfortunate coincidence that it had flashed just as she had shown him her face didn't work, Ryan declared that he would not let \"a couple of itchy... spots\" stand between them...and consequently ended up catching it as well.\n\nThey spent the time in home playing board games and trying to ignore the itch; with poor results, as they always ended up scratching each other. At some point [[Ross Geller|Ross]] and [[Rachel Greene|Rachel]] put them oven mitts and taped them to prevent the scratching, but after they left Ryan and Phoebe removed them to undress and have sex; though they ended up scratching each other again.\n\nThe chicken pox healed shortly before the two weeks passed and Ryan had to return to the seas. He was not allowed to tell the gang anything about the submarines or his destination.\n\n==Trivia==\n*It is said that Ryan returns to see Phoebe every two years, but he is not seen nor mentioned again during the eight years that passed between his appearance in Season 2 and the [[The Last One, Part 2|series finale]].\n[[Category:Season 2 Characters]]\n[[Category:Friends Characters]]\n[[Category:Males]]\n[[Category:One Appearance Only]]\n[[Category:Phoebe's relationships]]\n[[Category:Characters]]"}}}]}}}}