{"batchcomplete": "", "query": {"pages": {"1637": {"pageid": 1637, "ns": 0, "title": "Sandra Greene", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Sandra Greene\n| image = SandraGreen.png\n| gender = Female\n| first = [[The One With The Lesbian Wedding]]\n| last = [[The One With The Baby Shower]]\n| dob = \n| occ = housewife\n| number = 3\n| relatives = [[Sandra Greene's father|Father (name unknown)]]<br>[[Leonard Greene]] <small>(ex-husband)</small><br>[[Rachel Greene]] <small>(daughter)</small><br>[[Jill Greene]] <small>(daughter)</small><br>[[Amy Greene]] <small>(daughter)</small><br> [[Emma Geller-Greene]] <small>(granddaughter)</small>\n| seasons = <s>S1</s> [[Season 2|S2]] <s>S3</s> <s>S4</s> <s>S5</s> <s>S6</s> <s>S7</s> [[Season 8|S8]] <s>S9</s> <s>S10</s>\n| actor = [[Marlo Thomas]]\n}}\n'''Sandra Greene''' is the mother of [[Rachel Greene]]. She was portrayed by [[Marlo Thomas]].\n\nShe divorced [[Leonard Greene|Leonard]], the father of her three daughters (the other two being [[Jill Greene|Jill]] and [[Amy Greene|Amy]]), as she realized she never loved him any more than Rachel ever loved her jilted fiance [[Barry Farber|Barry]], at one point saying while discussing the divorce with Rachel \"You didn't marry your Barry honey, but I married mine.\" In one memorable moment she asked if [[Monica Geller]] and Rachel had any marijuana as part of her celebrating her imminent separation from her husband. She also danced with a \"wonderfully large woman\" at [[Carol Willick|Carol]] and [[Susan Bunch|Susan]]'s lesbian wedding, noting that while it was not necessarily something she would pursue, it was \"Nice to know I have options\". Upon seeing the [[Ugly Naked Guy]], she comments on his actions referring to him as an \"unattractive nude man\".\n\nSandra Greene also displays many of the characteristics that Rachel had before she set out on her own, including dependence on others for money, lack of respect for people in minimum-wage jobs, and lenient attitude towards marriage. However, upon seeing Rachel happy in her independent state, she says that she also desires to be independent.\n\nDuring Rachel's birthday party in Season Two, Sandra and her ex-husband each attended the party, prompting the gang to throw two separate parties to prevent the two interacting. As a last effort to conceal their presence from each other, [[Joey Tribbiani|Joey]] kissed Sandra while the gang smuggled Rachel's father past them, prompting Sandra to comment that it was the best party she'd been to in years.\n\n[[File:Rachel_shower.png|thumb|left|Monica trying to win Sandra back]]\nWhen [[Monica Geller|Monica]] runs Rachel a baby shower in season 8 she forgets to invite Sandra Greene, however invited both of Rachel's sisters, although only Sandra arrived. For a time, Sandra attempted to invite herself to live with Rachel to help her cope with the baby, but Ross helped Rachel see that she needed to learn how to be a mother on her own. Sandra showed a grudge against Monica during the shower for initially forgetting to invite her. Monica sticks up for herself and slams the door on Sandra as she leaves, only to then open the door and chase after Sandra apologizing.\n\n==Biography==\n===\"[[The One With The Lesbian Wedding]]\"===\nSandra makes her first appearance in this episode when she comes to see her daughter at [[Central Perk]] where she worked and later at her apartment announced that she's divorcing Rachel's father. She also stays for Carol and Susan's lesbian wedding and during the reception she says that she danced with a wonderfully large woman and that three other girls made eyes at her before finally saying that it's not something she wants to pursue but it was nice to know she had options.\n\n===\"[[The One With The Two Parties]]\"===\nSandra arrives at Rachel's birthday party just a few minutes after her ex-husband arrives there and as Monica opens the door for her and sees it's Sandra she closes it and opens it again when Dr. Greene is (for a while) out of sight. Monica claims she thought Sandra was Rachel and she comes in. During the party, Sandra brags everything at Rachel about Leonard and is unaware for the whole night that her ex-husband was also there. At the end of the party, she got kissed on the lips by Joey to prevent her from seeing her ex-husband while Dr. Greene walked away and the gang hid Sandra behind them, prompting her to comment that this was the best party she had been to in years.\n\n===\"[[The One With The Baby Shower]]\"===\nSandra makes her last appearance in this episode where she was forgotten to be invited to Rachel's baby shower and was called at the last minute. She showed a grudge against Monica throughout the shower and suggested moving into Ross' apartment to help take care of the baby, but Ross manages to change her mind. As she is leaving the party, Monica speaks angrily at her and she walks off. Monica soon chases after her apologizing.\n\n==Relationships==\n===[[Leonard Greene]]===\nSandra and her ex-husband, Leonard happened to have an imploding relationship and marriage. It seems that she had only married him for the sake of money and he for her looks. According to Rachel, they barely even spoke (except when they argued). They ended up getting divorced in [[Season 2]] and after that, they were completely unable to be in the same room, as shown when the gang throws Rachel two birthday parties with Rachel's mother in Rachel's apartment and her father in Joey and Chandler's apartment.\n\n===[[Rachel Greene]]===\nSandra loved her daughter and Rachel loved her back, although Rachel was sometimes exasperated when it came to her mother's snobbishness.  Had Rachel gone through with her planned move to Paris,  Sandra would have flown to Paris a few days later with [[Emma Geller-Greene|Emma]].\n\n===[[Jill Greene|Jill]] and [[Amy Greene]]===\nSandra's relationship with her other two daughters is completely unknown. It's possible that she must have loved them the same way she had to Rachel, unlike their father due to them not being able to make a great living on their own.\n\n===[[Ross Geller]]===\nSandra was very fond of [[Ross Geller]]. She considered him a nice person although in \"[[The One With The Two Parties]]\", she thought that Rachel had chosen 'a boyfriend like her (Rachel's) father', but she still had good opinions of him. \n\nAfter Ross sleeps with [[Chloe]] then Rachel breaks up with him in season 3, then they briefly get back together in the beginning of season 4. Rachel says that Sandra didn't want her to take back Ross, and that she considered Ross a cheater (\"Once a cheater, always a cheater\").\n\nAfter Rachel has [[Emma Geller-Greene|Emma]], Sandra seems to appreciate the support Ross is going to give Rachel with their baby in \"[[The One With The Baby Shower]]\" and in the uncut episode she tells him \"I've always liked you, Ross\".\n\n===Other Friends===\nSandra also knew Phoebe, Monica, Joey and Chandler. Sandra and Monica were on very good terms throughout the show until the former's last appearance in \"[[The One With The Baby Shower]]\" due to the latter forgetting to invite Sandra to the party. It is unknown what happened to their relationship afterwards. Sandra also had good relations with Phoebe and also Joey and Chandler, but she likely never gave the boys much thought (Although she did consider the kiss she shared with Joey at the end of Rachel's birthday party as having made it the best party she'd been to in years).\n\n==Trivia==\n* Sandra enjoys Atkins diets.\n* Although not specifically stated, Sandra would appear to be Jewish as her ex-husband Leonard has nothing but bacon in the fridge when Rachel and Ross go there after visiting him in hospital.\n* Sandra and her daughter [[Amy Greene|Amy]] had their lips done during the course of Rachel's pregnancy although it's not established whether they had them done at the same time.\n* Sandra is the only member of Rachel's family to have not been seen inside [[Ross' Third Apartment]] (although she could've if Ross hadn't changed his mind about letting her move in to help take care of [[Emma Geller-Greene|Emma]]) while Rachel and her other family members who appeared on the show were seen inside it:\n** Rachel - numerous times between [[Season 5]] and [[Season 10]], especially when being pregnant with Emma;\n** Leonard - \"[[The One With The Stripper]]\" when he goes over to yell at Ross for getting Rachel pregnant and not marrying her and almost destroying Ross and [[Mona]]'s relationship;\n** Jill - \"[[The One With Rachel's Sister]]\" and \"[[The One Where Chandler Can't Cry]]\" during her brief relationship with Ross;\n** Amy - \"[[The One With Rachel's Other Sister]]\" when she comes to borrow a hair-straightener and stay for Thanksgiving dinner and in \"[[The One Where Rachel's Sister Baby-Sits]]\" when she thinks Rachel still lives there.\n\n==Appearances==\n* \"[[The One With The Sonogram At The End]]\" (First mentioned)\n* \"[[The One With The Lesbian Wedding]]\" (First appearance)\n* \"[[The One With The Two Parties]]\"\n* \"[[The One With The Jellyfish]]\" (Mentioned only)\n* \"[[The One With All The Haste]]\" (Mentioned only)\n* \"[[The One With The Kips]]\" (Mentioned only)\n* \"[[The One With The Rumor]]\" (Mentioned only)\n* \"[[The One With The Baby Shower]]\"\n* \"[[The One Where Monica Sings]]\" (Mentioned only)\n* \"[[The One With The Lottery]]\" (Mentioned only)\n* \"[[The One After Joey And Rachel Kiss]]\" (Mentioned only)\n* \"[[The Last One, Part 1]]\" (Mentioned only)\n\n[[Category:Rachel's Family]]\n[[Category:Recurring Characters]]\n[[Category:Friends Characters]]\n[[Category:Mothers]]\n[[Category:Grandmothers]]\n[[Category:Divorcees]]\n[[Category:Season 2 Characters]]\n[[Category:Season 8 Characters]]\n[[Category:Females]]\n[[Category:Bullying Characters]]\n[[Category:Spoiled Characters]]\n[[Category:Ross & Monica's Family]]\n[[Category:Characters]]"}}}]}}}}