{"batchcomplete": "", "query": {"pages": {"10312": {"pageid": 10312, "ns": 0, "title": "Sarah Tuttle", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "\n:''Not to be confused with [[Sarah]]''\n\n{{Character\n| character name = Sarah Tuttle\n| image = Sarah_Tuttle.png\n| ep = [[The One Where Rachel Quits]]\n| number = 1\n| actor = [[Mae Whitman]]\n| name = Sarah Tuttle\n| gender = Female\n| dob = Between 1985 and 1989\n| occ = Student\n| relatives = Unnamed father\nUnnamed grandmother\n}}\n'''Sarah Tuttle''' is a girl scout in \"[[The One Where Rachel Quits]]\", portrayed by [[Mae Whitman]]. Sarah was part of the Brown Birds selling cookies to people. [[Ross Geller|Ross]] befriends her after he breaks her leg when he accidentally hits her with a tennis racket bag (with a racket inside) while she is selling cookies. Ross then sells the cookies on her behalf.\n\n==Background==\nSarah is a little girl who enjoyed to spends most of her time daydreaming about outer space. She has a very irresponsible father, who bets on slot machines using the money that Sarah's grandmother left her for her college. He also makes her clean apartments in order to afford a trip to the Taj Mahal casino.\n\nSarah sells cookies for the Brown Birds because the girl who sold the most would win a trip to Spacecamp, and gets to sit in a real space shuttle; but this goal was put on risk after Ross accidentally breaks her leg and leaves her temporarily incapacitated. She doesn't want to win the prize for the second place (a ten speed bike) because she'd rather have something her father couldn't sell. She also has to watch the news about the astronauts on the TV of the neighbor through the window because she didn't have TV (hinting that her father had also sold it).\n\nFeeling regret for ruining her dreams, Ross takes her place and starts to sell the cookies on her behalf. Sarah tells him that the girl who won last year sold 475 boxes; and after much effort, Ross manages to sell 517. Despite at the Brown Birds meeting, Ross managed to sell 872 cookies, the fact that he bought a lot of cookies for himself which does not count, he loses to a girl who sold 871 and to another one who sold more than 2000 (after she loaned her uniform to her 19 year old sister, who went to sell the cookies to the U.S.S. Nimitz); thus not winning any prize.\n\nAt the end of the episode, Ross takes Sarah to [[Chandler and Joey's apartment]] where they have made a private space camp for her. Ross puts her on a seat decorated with foil and he, [[Joey Tribbiani|Joey]] and [[Chandler Bing|Chandler]] all turn her around on the chair while pretending to be aliens and throwing an asteroid. The camera turned to her, revealing a big smile on her face, obviously showing she was enjoying it.\n[[Category:Season 3 Characters]]\n[[Category:One Appearance Only]]\n[[Category:Characters]]\n[[Category:Females]]\n[[Category:Friends Characters]]"}}}]}}}}