{"batchcomplete": "", "query": {"pages": {"3353": {"pageid": 3353, "ns": 0, "title": "Sid Goralnik", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n|character name = Sid Goralnik\n|ep = \n|image = Sid.png\n|number = 2\n|actor = Maurice Godin\n|name = Sid Goralnik\n|gender = Male\n|occ = Wall St.\n|relatives = [[Janice Litman Goralnik]] (wife) <br> [[Aaron Goralnik]] (son) <br> Unnamed stepdaughter\n|first = \"[[The One Where Rachel Has A Baby, Part 1]]\"\n|last = \"[[The One Where Rachel Has A Baby, Part 2]]\"}}\n'''Sid Goralnik''' is the second and current husband of [[Janice]]. He is almost completely deaf. He has a son with her.\n\n==Biography==\n===[[Season 8]]===\nWhen Ross and Rachel were at the hospital having their baby, Janice was put in the same room as them where it was revealed that she had remarried to Sid and was having a son. Ross and Rachel wondered how he could handle Janice's awful voice but then they learned that he is almost completely deaf. (\"[[The One Where Rachel Has A Baby, Part 1]]\")\n\nWhen Janice goes into labor, Sid tells Rachel and Ross that it was nice to meet them and then Janice yelled \"SID!!!\" That was the first time Sid ever heard her voice and he claims he didn't care for it at all. Their son is born at the end of the episode. (\"[[The One Where Rachel Has A Baby, Part 2]]\")\n\n===[[Season 9]]===\nJanice runs into Monica and Chandler at a fertility clinic and reveals that she and Sid are trying to have another kid, but have not had good luck. After Chandler goes in and comes out, he see's that Janice is still there and she says that porn isn't allowed at home so this is like vacation for him. (\"[[The One With The Fertility Test]]\")\n\n===[[Season 10]]===\nJanice and Sid are looking for a house in Westchester to raise their son Aaron (and most likely Janice's daughter/Sid's stepdaughter) and run into Monica and Chandler. Janice and Sid plan to buy the house next door but they decide not to when Chandler lies to Janice saying he's still in love with her. (\"[[The One Where Estelle Dies]]\")\n\n==Trivia==\n*Sid is almost completely deaf.\n*Sid's relationship with his stepdaughter was never shown.\n*Sid has been in only two episodes despite being mentioned several times afterward.\n[[Category:Friends Characters]]\n[[Category:Fathers]]\n[[Category:Season 8 Characters]]\n[[Category:Males]]\n[[Category:Recurring Characters]]\n[[Category:Characters]]"}}}]}}}}