{"batchcomplete": "", "query": {"pages": {"5120": {"pageid": 5120, "ns": 0, "title": "Steve Cera", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": ": ''For other characters named Steve see [[Steve]].''\n\n{{Character\n| character name = Steve Cera\n| image = [[File:Stevie.png|250px]]\n| ep = [[The One With The Girl Who Hits Joey]]\n| number = 1\n| actor = [[Willie Garson]]\n| name = Steve Cera\n| gender = Male\n}}\n\n'''Steve Cera''' is [[Ross Geller|Ross]]' neighbor and the president of the tenants' committee, portrayed by [[Willie Garson]].\n\nHe meets Ross shortly after the latter moves into the apartment [[Ugly Naked Guy]] used to live in and informs him that he is collecting $100 from everyone in the building to throw a party for [[Howard]], the handyman who is set to retire the following week. However, Ross doesn't want to donate the $100 because he just moved in and though it was unreasonable to be asked to do so, leading to friction between the two.\n\nSteve appears to be a good-natured but at the same time rather shallow, self-absorbed and close-minded individual who lacks the ability to look at things through the perspective of other people and consequently has a tendency to sometimes get the wrong impression of them. As a result, he developed a highly negative opinion of Ross and came to think of him as a cheapskate when he refused to contribute $100 towards Howard's party, despite Ross' attempts to explain that he wasn't being unreasonable because he had only just moved into the building and had never even met Howard before.\n\nSteve could also possibly be considered an antagonist given his openly critical and disapproving attitude towards Ross, as could the rest of the latter's neighbors, who treat him much the same way after hearing Steve's version of the reason why he refused to contribute any money towards Howard's party.\n[[Category:Friends Characters]]\n[[Category:Season 5 Characters]]\n[[Category:One Appearance Only]]\n[[Category:Bullying Characters]]\n[[Category:Antagonists]]\n[[Category:Males]]\n[[Category:Characters]]"}}}]}}}}