{"batchcomplete": "", "query": {"pages": {"2751": {"pageid": 2751, "ns": 0, "title": "Susie Moss", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Susie Moss\n| image = [[Image:Susie Moss2.png|300px]]\n| gender = Female \n| ep = [[The One After The Superbowl, Part 2]] \n| dob = \n| occ = Hair and make-up dresser \n| nickname = Susie Underpants (age 10-18)\n| relatives = \n| actor = [[Julia Roberts]] \n| relationships = [[Chandler Bing]] (ex-boyfriend)\n}}\n\n'''Susie Moss''' is a woman who dates [[Chandler Bing|Chandler]] in \"[[The One After The Superbowl, Part 2]]\",  portrayed by [[Julia Roberts]]. Chandler knew her in fourth grade, at the time she wore glasses and carried around a box of animal crackers like a purse. She grew up to become a hair and makeup dresser for films. \n\n==Relationship with Chandler==\nSusie runs into Chandler on the set of ''[[Outbreak 2: The Virus Takes Manhattan]]'', where she is hair and makeup for the actors. The two of them reminisce about grade school. Susie reminds him of the time during a class play where he lifted up her skirt. Chandler apologizes saying that he used to use humor as a defense mechanism and that \"thank God I don't do that anymore!\" Susie continues to hint at Chandler to ask her out; he does and they begin dating.\n\nOne night they go out to dinner and she asks him to wear her panties while they're out to which he agrees. In the middle of dinner, they sneak off to the men's room where Susie tells Chandler to take off everything but the panties. When he does, she takes all his clothes and runs out. He yells to her, asking her what she's doing. She tells him \"This is for the fourth grade.\" As it turns out, when Chandler pulled up her skirt in fourth grade, it was a traumatizing experience for her. It gave her the nickname \"Susie Underpants\" until she was 18. Chandler asks her how she could still be mad about that. She responds in a slightly beat tone \"Why don't you call me in twenty years and tell me if you're still upset about this.\" \n\nShe left the bathroom and hasn't been seen since.\n\n== Trivia ==\n* At the time when this episode originally aired, Roberts and Perry were actually in a relationship.\n[[Category:Friends Characters]]\n[[Category:Season 2 Characters]]\n[[Category:One Appearance Only]]\n[[Category:Chandler's relationships]]\n[[Category:Bullying Characters]]\n[[Category:Antagonists]]\n[[Category:Females]]\n[[Category:Characters]]"}}}]}}}}