{"batchcomplete": "", "query": {"pages": {"23504": {"pageid": 23504, "ns": 0, "title": "The Kids", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "=='''Ben Geller'''==\n'''Ben Geller''' is the son of [[Ross Geller]] and [[Carol Willick]]. He is born in \"[[The One With The Birth]]\", and lives with his mother and her wife, [[Susan Bunch]]. Ben is played as an infant by Michael Gunderson, by brothers Charles Thomas Allen and John Christoper Allen from Season 3 to 5, and by Cole Sprouse from Season 6 to 8.\n*Gender: Male\n*Date of birth: May 11, 1995\n=='''Emma Geller-Greene'''==\n'''Emma Geller-Greene''' is the daughter of [[Ross Geller]] and [[Rachel Greene]]. Rachel's pregnancy was originally revealed in the season finale of Season 7.\n\nEmma is born in \"[[The One Where Rachel Has A Baby, Part 2]]\". Emma lives with both her parents after she is born, until they get into a fight over Ross not telling Rachel that a man that she met at a bar left a message for her. Rachel then moves back in with Joey. In the series finale, her parents reconcile.\n*Gender: Female\n*Date of birth: May 16, 2002\n=='''Jack Bing'''==\n'''Jack Bing''' is one of [[Monica Geller|Monica]] and [[Chandler Bing|Chandler]]'s two children. Monica and Chandler adopted Jack and his twin sister Erica from a girl, also named [[Erica]], living in Ohio.\n\nJack and Erica were born in the series finale. Monica and Chandler were unaware at the time of their birth that they would be receiving twins and Monica had to calm Chandler down at first. Upon seeing Jack for the first time, Chandler commented that he had Monica's eyes (despite acknowledging that it was impossible for this to actually be the case).\n\nJack was named after his adopted grandfather. Phoebe commented that his full name sounded like a 1940's reporter.\n*Gender: Male\n*Date of birth: May 6, 2004\n=='''Erica Bing'''==\n'''Erica Bing''' is Monica and Chandler's adopted daughter. She and her twin brother Jack were adopted from a young woman, also named Erica, living in Ohio.\n\nJack and Erica were born in the series finale. Monica and Chandler were unaware at the time of their birth that they would be receiving twins and Monica had to calm Chandler down at first. Erica was second to be born and therefore the unexpected baby.\n\nErica was named after her biological mother, Erica, although both Erica and Joey appeared not to fully register Chandler and Monica's reasons for choosing that name for her: When Monica and Chandler tell Erica that they are naming their daughter after her she responds \"Oh My God! That's just like my name!\". When Joey learns her name, he says \"Hey, that pregnant girl's name was Erica.\" Chandler responded with \"It's a shame you two didn't spend much time together!\"\n*Gender: Female\n*Date of birth: May 6, 2004\n=='''Phoebe's'''==\n[[Phoebe Buffay|Phoebe]] didn't have kids for herself during the show (just [[The Triplets|the triplets]]), although she and [[Mike Hannigan|Mike]] decide to have kids in the series finale after seeing Erica and Jack. It's revealed in the spin-off that they have at least one child.\n=='''Joey's'''==\n[[Joey Tribbiani|Joey]] didn't have kids during the show.\n[[Category:Characters]]\n[[Category:Friends Characters]]"}}}]}}}}