{"batchcomplete": "", "query": {"pages": {"1778": {"pageid": 1778, "ns": 0, "title": "The Chick and The Duck", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Duck Sr.\n| image = Duck Sr.jpg\n| Caption =\n| first = [[The One With A Chick And A Duck]]\n| last =[[The One With Rachel's Book]] \n| number =21 \n| actor = \n| name = Duck Sr.\n| nickname = Dick\n| gender = Female\n| dob =1995\n| relatives = [[Joey Tribbiani]] (owner) <br> [[Chandler Bing]] (owner)\n| occ = Pet\n}}\n{{Character\n| character name = Chick Sr.\n| image = Chick Sr.jpg\n| name = Chick Sr.\n| nickname = The Rooster<br/>Yasmine\n| gender = Male\n| dob = 1997\n| number = 18\n| first = [[The One With A Chick And A Duck]]\n| relatives = [[Joey Tribbiani]] (owner)<br/>[[Chandler Bing]] (owner)\n| occ = Pet\n| last = [[The One With Mac And C.H.E.E.S.E]]\n}}\n\n'''The Chick and the Duck '''were a chicken and a duck owned by [[Chandler Bing]] and [[Joey Tribbiani]].\n\n==Early Life==\nIn the episode \"[[The One With A Chick And A Duck]]\", Joey bought the chick from an animal sanctuary as a gift for Chandler after seeing (and misunderstanding) a news report about people who buy chicks and then find they cannot properly care for them.\n\n[[Phoebe Buffay|Phoebe]] encouraged Chandler to return the chick but Chandler, discovering that the chick was in danger of being euthanized, did not have the heart and returned home with the chick and a duck. It turned out that, after hitting a few bumps (such as getting the chick stuck in the VCR) the two were perfectly capable of caring for the birds, and they were well loved.\n\n==Later life==\nA recurring gag throughout the series has Chandler and Joey treating the chick and the duck as their own children, a continuation of the earlier gag that Joey and Chandler acted like a married couple. At one point, Chandler punishes the duck for trying to eat the chick by sending him out to the hall; stating, \"You stay out here and think about what you did!\", greatly surprising [[Ross Geller|Ross]] and [[Rachel Greene|Rachel]]. On another occasion, when Joey threatened to move out after Chandler kissed his girlfriend, [[Kathy]], Chandler attempted to convince him to stay by arguing that the chick and the duck had been having a hard year recently, due to the apartment being robbed.\n\nEventually, when the chick unexpectedly grew into a rooster (Chandler and Joey believing that the chick was female prior to this development), Monica and Rachel [[The Contest|made a bet]] with Joey and Chandler where they would give away the rooster and the duck if they lost, but Chandler and Joey would get the girls' apartment if they won; the transition was only temporary. On a later occasion, the duck swallowed Ross' engagement ring during the bachelor party for his wedding to [[Emily Waltham|Emily]], requiring the duck to be taken to the vet to get it out. When Chandler moved to Monica's apartment, it is revealed that Monica hates them but disguises it as an allergy which prevents them from visiting.  \n\nThe Chick was last seen in the episode \"[[The One With Mac And C.H.E.E.S.E.]]\" which took place in April 2000. The Chick is not seen, mentioned or heard afterwards which gives the impression it probably died. This would have made it three years old at the time of it's death as it was born in 1997. The Duck last appeared in the episode \"[[The One With Rachel's Book]]\" which took place in October 2000. The Duck does not appear afterwards which brings about the probability that the face cream it ate unfortunately killed it. The Duck was probably born around 1995 because it is said to have been an ex battery duck before coming to live with Joey and Chandler. Most duck farmers sell their ducks at around two years old when egg production drops. This would make the Duck around five years old at the time of it's death. \n\n==Abrupt disappearance==\nAfter about [[Season 6]] the animals disappeared (the duck was mentioned but not seen in Season 7 as having thrown up on Joey's bed), and in the final episode it was revealed that they had died of old age some time ago, but Chandler and the rest of the group had lied to Joey to save his feelings, telling him that they had gone to a special farm where they were very happy but could not be visited.\n\n==Names==\nChandler named the chick \"'''Yasmine'''\", after Yasmine Bleeth, an actress on ''[[Baywatch]]'', a television program he and Joey frequently watched, though the chick later turns out to be a male when he grows into a rooster. In \"[[The One With Ross' Thing]]\", Joey and Chandler are discussing if the chick and the duck had a baby, Joey says \"we could call it Chuck!\" '''ch'''ick d'''uck''', Chandler responds with \"or, Dick\" \"'''d'''uck ch'''ick'''. Later in that episode, Chandler refers to the duck as Dick.\n\n== Appearances ==\n* \"[[The One With A Chick And A Duck]]\"\n* \"[[The One With The Screamer]]\"\n* \"[[The One With Ross' Thing]]\"\n* \"[[The One With The Cat]]\"\n* \"[[The One With The Cuffs]]\"\n* \"[[The One With Joey's New Girlfriend]]\"\n* \"[[The One Where Chandler Crosses The Line]]\"\n* \"[[The One With Chandler In A Box]]\"\n* \"[[The One With The Embryos]]\"\n* \"[[The One With Joey's Dirty Day]]\"\n* \"[[The One With Rachel's New Dress]]\"\n* \"[[The One With The Worst Best Man Ever]]\"\n* \"[[The One Where Phoebe Hates PBS]]\"\n* \"[[The One With All The Thanksgivings]]\" (Duck only)\n* \"[[The One With All The Resolutions]]\" \n* \"[[The One With Chandler's Work Laugh]]\"\n* \"[[The One Where Ross Can't Flirt]]\" (Duck appears; Chick mentioned only)\n* \"[[The One With The Ball]]\" (heard only)\n* \"[[The One With The Routine]]\"\n* \"[[The One With Mac And C.H.E.E.S.E]]\" \n* \"[[The One With Rachel's Book]]\" (Duck heard only) \n\n==Chick Jr. & Duck Jr.==\n{{Character\n| character name = Duck Jr.\n| image = Duck Jr.jpg\n| Caption = Joey sat with Duck Jr.\n| ep = [[The Last One, Part 1]]\n| number = 1\n| actor = \n| name = Duck Jr.\n| nickname = \n| gender = \n|dob =2004\n| relatives = [[Joey Tribbiani]] (owner)|occ = Pet\n}}\n{{Character\n| character name = Chick Jr.\n| image = Chick Jr.jpg\n| name = Chick Jr.\n| dob = 2004\n| occ = Pet\n| relatives = [[Joey Tribbiani]] (owner)\n| ep = [[The Last One, Part 1]]\n| number = 1\n}}\n\nIn the final episode, Joey bought Chandler a new chick and duckling as a housewarming gift (Joey named them \"Chick Jr.\" and \"Duck Jr.\" respectively).\n\nIn the end, Chandler tells Joey to keep them himself and, again after a few bumps (this time they got stuck in the foosball table), he even considered getting a goose, but Chandler quickly discouraged him, telling him he was \"set with the poultry\". The birds did not make an appearance on the ''Friends'' spinoff ''[[Joey (TV series)|Joey]]'', and their final fate is unknown (it is possible that they did in fact move in with Chandler and Monica).\n[[Category:Friends]]\n[[Category:Friends Characters]]\n[[Category:Recurring Characters]]\n[[Category:Animals]]\n[[Category:Deceased Characters]]\n[[Category:Pets]]\n[[Category:Residents of the Friends building]]\n[[Category:Season 3 Characters]]\n[[Category:Characters]]"}}}]}}}}