{"batchcomplete": "", "query": {"pages": {"4962": {"pageid": 4962, "ns": 0, "title": "Tommy", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{Character\n| character name = Tommy\n| image = [[File:Tommy.jpg|200px]]\n| name = Tommy\n| gender = Male\n| ep = [[The One With The Screamer]]\n| number = 1\n| actor = [[Ben Stiller]]}}\n{{CharQuote|The guy is mean, I mean really mean!|4 = Ross trying to warn Rachel about Tommy}}\n'''Tommy''' is a man who briefly dates [[Rachel Greene|Rachel]] in [[season 3]], portrayed by [[Ben Stiller]]. He is filled with rage, which he does well to hide from her while in her presence. He frightens and intimidates anyone who irritates him in the slightest way by viciously screaming at them.\n\nTommy pretends to be a nice guy while in the presence of Rachel. However, after meeting Ross and Rachel at the theater, [[Ross Geller|Ross]] sees his true colors after witnessing him intimidate an elderly couple who were accidentally in their seats by yelling his throat hoarse at them and calling them stupid (Rachel was absent at the time).\n\nA stunned Ross tries to warn Rachel and the others what an aggressive bully Tommy is, but they refuse to believe him, assuming he's just making up the story about Tommy screaming at the elderly couple in order to split them up and have her all to himself so soon after Ross and Rachel broke up. Ross is also teased over this by [[Chandler Bing|Chandler]], much to the former's chagrin. Tommy later uses the fact that Ross almost spills hot coffee on him as an excuse to intimidate him by ranting and shouting insults at him, but the rest of the friends do not see this happen. Intimidating people in this manner apparently amuses Tommy, who appears to be in a good mood after frightening both Ross and the elderly couple, but he does not let Rachel see his aggressive true colors, laughing off the fact that Ross has almost spilled hot coffee on him when he does it a second time while in her presence. Considering that Tommy had learned of Ross's past with Rachel and witnessed how awkward they were around each other prior to screaming at both the elderly couple and Ross himself, it is likely that Tommy guessed after witnessing this that she wouldn't believe Ross if he ever told her what a bully Tommy really was.\n\nBut Tommy's true colors are finally exposed to her when he loses his temper after [[Joey Tribbiani|Joey]] and Chandler's pet baby chicken urinates on his hand, and their pet duck irritates him by quacking at him. Unable to keep his anger in check, he takes it out on both of the animals by screaming at them - loud enough for Rachel, [[Monica Geller|Monica]], [[Phoebe Buffay|Phoebe]], Chandler and Ross to overhear him and walk into the room. When he sees them all staring at him, and stunned, he, to his own chagrin, is forced to accept the fact that Rachel and the others are now scared of him, and breaks up with her before leaving. He is never seen again after that.\n\n==Quotes==\n{{Quote|(Ross accidentally bumps into Tommy) What's in the cup Ross? (Ross:Uhm!) What is in the cup? (Ross: Okay, it's coffee) Iced coffee? Tell me it's iced coffee. (Ross: It... It's hot...) HOT COFFEE! YOU IDIOT! YOU'RE GONNA SPILL HOT COFFEE ALL OVER ME HUH? WHAT ARE YOU? JUST A BIG DUMB STUPID DOOFY IDIOT WITH A DOOFY IDIOT HAIRDO HUH? HUH?|Tommy screaming at Ross for bumping into him with his coffee.}}\n{{Quote|IDIOT! YOU STUPID LITTLE FUZZY YELLOW CREATURE! OH LOOK AT ME I'M SO CUTE, I'M A LITTLE CHICK WHO'S DISGUSTING! GOD, YOU'RE SO STUPID! HOW ARE YOU NOT YET EXTINCT?|Tommy screaming after the chick urinates in his hand.}}\n{{Quote|QUACK QUACK, WHAT ARE YOU QUACKING ABOUT? DUMB DONALD DODO!|Tommy screaming at the duck.}}\n{{Quote|Well I guess we're not going out anymore. MAN!|Tommy breaking up with Rachel after seeing her fears.}}\n[[Category:Friends Characters]]\n[[Category:Season 3 Characters]]\n[[Category:One Appearance Only]]\n[[Category:Antagonists]]\n[[Category:Bullying Characters]]\n[[Category:Rachel's relationships]]\n[[Category:Males]]\n[[Category:Mentally Ill Characters]]\n[[Category:Characters]]"}}}]}}}}