{"batchcomplete": "", "query": {"pages": {"1996": {"pageid": 1996, "ns": 0, "title": "Tribbiani Sisters", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "[[Image:TribbianiSisters.jpg|thumb|250px|The Tribbiani sisters.]]\n\n'''[[Joey Tribbiani]]''' comes from a family of eight children, where he is the only male. He has seven sisters: '''Gina''', '''Tina''', '''Dina''', '''Mary-Angela''', '''Mary-Therese''', '''Veronica''', and '''Cookie'''. One of Joey's sisters is in prison, however, it is unknown which one.\n\n==Gina==\n[[Image:GinaTribbiani1.jpg|thumb]]\n\n{{Main|Gina Tribbiani}}\n\n'''Gina''' is Joey's eldest sister. In the spin off series ''[[Joey Tribbiani|Joey]]'', Gina and her son [[Michael Tribbiani|Michael]] live with Joey in L.A.\n\nShe was played by [[Drea de Matteo]] on ''Joey'' and K.J. Steinberg on ''[[Friends]]''.\n\n==Tina==\n[[File:TinaTribbiani.jpg|thumb|Tina]]\n\n{{Main|Tina}}\n'''Tina''' is one of Joey's younger sisters.\n\nIn \"[[The One With The Boobies]]\", when Joey is explaining his situation to the gang about his parents, he shares towards the end \"And my little sister, Tina, can't see her husband anymore because he got a restraining order.\"\n\n==Dina==\n[[Image:DinaTribbiani.jpg|thumb]]\n{{Main|Dina}}\n'''Dina '''appeared in \"[[The One With Monica's Boots]]\", in which Joey learns that she is pregnant. Dina is Joey's youngest sister. She is considered the smartest and most well behaved of the Tribbiani children. She took the SATs and went to college for \"both years\", but still isn't terribly bright. At one point, she asks Rachel, \"Do you ever worry that you'll be walking and your baby will just slip out?\"\n\nWhen Dina discovered she was pregnant, she went to Rachel first, asking her to help her tell Joey, because she is in a similar situation. Dina says that Joey is her favorite guy in the world and that she was more scared to tell him that she was pregnant than anyone else.\n\nShe was portrayed by [[Lisa Melilli]] in \"[[The One Where Chandler Can't Remember Which Sister]],\" and by [[Marla Sokoloff]] in \"[[The One With Monica's Boots]].\"\n\n==Mary-Angela==\n[[Image:MaryAngela.jpg|thumb]]\n\n{{Main|Mary-Angela}}\nIn the episode \"[[The One Where Chandler Can't Remember Which Sister]]\", all seven sisters arrive at [[Chandler and Joey's apartment]] for Joey's birthday party. Chandler gets extremely drunk and fools around with one of them, but cannot remember which sister it was. Chandler eventually finds out it was Mary-Angela, with consequences.\n\nMary-Angela apparently isn't a talkative person, as her grandmother seems to be used to talking for her, as she answered all of the questions Chandler attempted to ask Mary-Angela at the dinner party while trying to establish which sister was her.\n\nShe was portrayed by [[Holly Gagnier]].\n\n==Mary-Therese==\n[[File:Mary Therese.jpg|thumb]]\nMary-Therese is the one that Chandler thought was Mary-Angela when she told him to meet in the bathroom.\n\n{{Main|Mary-Therese Tribbiani}}\n\n==Veronica==\nNot much is known about Veronica. In the ''Joey'' episode \"[[Joey and the Fancy Sister]]\", Joey mentions that the way to control her is with food.\n\n==Cookie &nbsp;==\n[[Image:CookieTribbiani.jpg|thumb]]\n{{Main|Cookie}}\nCookie is the most aggressive of the Tribbiani sisters. She is the one that punches Chandler for emotionally hurting her sister when he failed to recognize her after drunkenly making out with her in \"[[The One Where Chandler Can't Remember Which Sister]]\". She also tells Phoebe that she shot her husband (though she may have been joking just to freak Phoebe out), then made herself a glass of vodka and cranberry juice. In ''Joey'', Joey claims that she has a mustache.\n\nShe was portrayed by [[Alex Meneses]].\n[[Category:Friends Characters]]\n[[Category:Recurring Characters]]\n[[Category:Joey's Family]]\n[[Category:Mothers]]\n[[Category:Aunts]]\n[[Category:Season 3 Characters]]\n[[Category:Season 8 Characters]]\n[[Category:Females]]\n[[Category:Joey Characters]]\n[[Category:Joey Season 1 Characters]]\n[[Category:Joey Season 2 Characters]]\n[[Category:Characters]]"}}}]}}}}