{"batchcomplete": "", "query": {"pages": {"1799": {"pageid": 1799, "ns": 0, "title": "Ursula Buffay", "revisions": [{"slots": {"main": {"contentmodel": "wikitext", "contentformat": "text/x-wiki", "*": "{{CharQuote|<center>'''[[Running Gags#\"Right, okay.\"|Right, okay.]]'''</center>}}\n{{Character\n| character name = Ursula Buffay\n| image = Ursula Pamela Buffay.png\n| gender = Female\n| first = \"[[The One With Two Parts, Part 1]]\"\n| last = \"[[The One With The Halloween Party]]\"\n| dob = February 16, 1966\n| occ = Waitress<br> Pornographic actress<br> Governor of New York\n| number = 8\n| relatives = [[Frances]] <small>(adoptive grandmother)</small> <br> [[Frank Buffay]] <small>(father)</small> <br> [[Lily Buffay]] <small>(adoptive mother)</small> <br> [[Phoebe Abbott]] <small>(biological mother)</small> <br> [[Lily's second husband/Phoebe and Ursula's stepfather|Lily's second husband]] <small>(stepfather)</small> <br> [[Mrs. Buffay (Frank Sr.'s second wife)|Mrs. Buffay]] <small>(stepmother)</small> <br> [[Phoebe Buffay]] <small>(twin sister)</small> <br> [[Frank Buffay Jr.]] <small>(paternal half-brother)</small> <br> [[Alice Knight]] <small>(half-sister-in-law)</small> <br> [[Mike Hannigan]] <small>(brother-in-law)</small> <br> [[Frank Buffay Jr. Jr.]] <small>(half-nephew)</small> <br> [[Leslie Buffay]] <small>(half-niece)</small> <br> [[Chandler Buffay]] <small>(half-niece)</small>\n| actor = [[Lisa Kudrow]]\n| relationships = [[Joey Tribbiani]] <small>(ex-boyfriend)</small><br> [[Malcolm]] <small>(ex-boyfriend)</small><br>[[Eric]] <small>(ex-fiancé)</small><br> Ira <small>(ex-boyfriend)</small>|aliases = [[Phoebe Buffay]]<small> (her pornstar name)</small>\n}}\n\n'''Ursula Pamela Buffay''' is a fictional character appearing on the two sitcoms ''[[Wikipedia:Mad About You|Mad About You]]'' and ''[[Friends]]''. She is portrayed by [[Lisa Kudrow]], who also portrayed her identical twin sister and one of the six main characters on ''[[Friends]]'', [[Phoebe Buffay|Phoebe]].\n\nUrsula originally appeared as a ditzy waitress on ''Mad About You'', working at Paul and Jamie's favorite New York City restaurant, Riff's. When Lisa Kudrow was cast as Phoebe, who also lives in New York City, producers decided to have the character cross over into ''Friends''.\n\n==History==\nUrsula and her twin sister [[Phoebe Buffay|Phoebe]] were the results of a sexual relationship between [[Phoebe Abbott]], [[Frank Buffay]] and [[Lily Buffay]]. A scared Phoebe Abbott wasn't ready to be a mother, so she gave them to Lily after giving birth. Lily adopted both twins and she and Frank raised them together. Later Frank abandoned Lily and the twins and Lily married another man. Then Lily's husband went to prison, and Lily committed suicide by carbon monoxide poisoning. Ursula went into care while Phoebe ended up on the streets. Ursula also broke many things of Phoebe's which is mentioned in \"[[The One With Two Parts, Part 1]]\".\n\n== Personality ==\nUrsula is usually regarded for her incompetence when it comes to doing her job, due to being almost completely oblivious to what's happening around her. However, this mostly stems from her apathetic attitude towards other people and their needs, and holds little to no value in anything besides her own well-being. Ursula is also shown to be very neglectful of her job, yet somehow still works there. She is labeled as an antagonist in the series.  \n\nUrsula is also known for being an unpleasant individual. She is shown to be very selfish and insensitive when it comes to confrontation, and often disregards the consequences of her own actions. Ursula only holds herself in high opinion, being very self-centered and self-absorbed, treating others as if they are beneath her. This especially noticeable whenever she confronts her sister, Phoebe.\n\nShe often treats Phoebe as if she were a complete stranger, to the point where it's almost like Ursula forgets she even has a sister. On the rare occasions where Ursula does acknowledge Phoebe, she insults her and makes her feel insignificant, often nonchalantly. Ursula ruins her sister's life in many ways, such as using her name when making porn or stealing a number of her boyfriends.\n\nMuch of the reason why Ursula has inspired so much hatred between the two of them come from Phoebe's jealousy. Ever since she was a kid, Ursula has always been recognized as the better twin, due to being seen as more pretty and smarter than her sister. She was given a luxurious upbringing, while Phoebe was forced to fend for herself on the streets.\n\n==On ''Mad About You''==\nIn ''Mad About You'', Ursula was a particularly inept waitress, often forgetting orders entirely. Her character was more fully developed in ''Friends'' \"as something of an antagonist or evil twin\".\n\nOn the last episode of ''Mad About You'', it was revealed that Ursula would become the Governor of New York in the future.\n\n==On ''Friends''==\nUrsula often appeared cruel and hostile to twin [[Phoebe Buffay|Phoebe]], who was still upset by the things Ursula did to her when they were young, for example, throwing her Judy Jetson thermos under a bus, accidentally breaking her collarbone and stealing her first boyfriend back in junior high. This drove a wedge between the sisters, and the estrangement continued into adulthood. Although Phoebe ended up homeless by her mid-teens, following the various deaths/abandonments/imprisonments of their parents, Ursula apparently did not. How the sisters came to be separated as minors was never revealed.\n\nUrsula dated [[Joey Tribbiani|Joey]] in \"[[The One With Two Parts, Part 1|The One With Two Parts]]\". Naturally, Phoebe became worried. Ursula dumped Joey shortly after by not talking to him and avoiding meeting him. Phoebe pretended to be Ursula to break up with Joey gently, but was found out nonetheless.\n\nIn \"[[The One With The Jam]]\", Ursula's stalker [[Malcolm]] followed Phoebe by mistake.\n\nIt was revealed in \"[[The One With The Jellyfish]]\" that Ursula had always known the truth about her and Phoebe's parentage. She told Phoebe she had read their adoptive mother's suicide note which revealed the identity of their birth mother, [[Phoebe Abbott]]. When Phoebe asked to see the note, she showed Phoebe one that she had hastily written up. In Ursula's word, her version \"got the gist\" of the original suicide note, which she had apparently lost in the interim. \n\nIn \"[[The One With Joey's Bag]]\", Phoebe told Ursula their grandma had just died, but Ursula thought she died 5 years ago and had already made peace with it, so wouldn't go to her memorial service, plus Ursula had a concert to go to.\n\nIn \"[[The One Where Chandler Can't Cry]]\", it was revealed that Ursula works in the pornography industry, using her sister's first name so she was credited as Phoebe Buffay. She appeared in such films as \"Buffay the Vampire Layer\", \"Sex Toy Story 2\", \"Lawrence of a Labia\" (an actual adult film title), and \"Inspect Her Gadget\". After telling her off for using her name, Phoebe paid her back by taking all her checks from the porno film company, as the checks were addressed to \"Phoebe Buffay\". In \"[[The One With Phoebe's Cookies]]\", Phoebe reveals that she is no longer speaking to Ursula after that incident.\n\nIn \"[[The One Where They All Turn Thirty]]\", Phoebe takes her pink hippity hop to Ursula to wish her a happy 30th birthday and patch things up with her. However, Ursula informs Phoebe that they are actually 31. In showing Phoebe her birth certificate, it is revealed that Ursula's middle name is Pamela. Ursula also sold Phoebe's birth certificate to a Swedish runaway, as a result, Phoebe did not know what her middle name was.\n\nIn \"[[The One With The Halloween Party]]\" Ursula and her fiancé, [[Eric]] (played by [[Wikipedia:Sean Penn|Sean Penn]]) attended a Halloween party thrown by Monica and Chandler. Phoebe discovered that Ursula had been lying to her fiancé claiming that she was a teacher at the Top Secret School for the Children of Spies, that she was in the Peace Corps, saying \"It wasn't a town when I got there, but it was a town when I left\" and also that she didn't smoke and was a part of a church group. Phoebe revealed this to Eric upon which he broke up with Ursula and began dating Phoebe in the following episode \"[[The One With The Stain]]\". However they soon broke up because Eric had sex with Ursula mistaking her for Phoebe.\n\n==Trivia==\n*In the episode \"[[The One With Two Parts, Part 1]]\", the characters Jamie Buchman and Fran Devanow from ''Mad About You'' walk into [[Central Perk]] and confuse Phoebe with Ursula. Since Ursula is naturally forgetful, Jamie writes off Phoebe's genuine ignorance of who Jamie is as one of Ursula's quirks.\n*In \"[[The One With The Halloween Party]]\", Phoebe tells Ursula's fiancé, Eric, that she is a minute younger than Ursula.\n*In some episodes, Lisa's older sister Helene Kudrow plays Ursula Buffay. \n*Ursula appears to be shorter than Phoebe (possibly a result of Helene playing her).\n*In ''Mad About You ''\"Natural History,\" Ursula says she hates her name.\n*Ursula does porn under the name \"Phoebe Buffay\" and stars in movies such as \"Buffay, the Vampire Layer\", \"Inspect Her Gadget\", and \"Sex Toy Story 2\". Gunther is a fan, but never mentions anything to Phoebe or any of the friends, until Joey brings up the subject in \"[[The One Where Chandler Can't Cry]]\". \n*She never meets Monica, Rachel, or Ross (at least on-screen). She also never shared a scene with any member of her family besides Phoebe.\n**This makes her the only sibling of any of the six friends who was never introduced to the gang (though all of them saw her in a videotape in \"[[The One Where Chandler Can't Cry]]\").\n\n==Appearances==\n===Friends===\n*\"[[The One With The Sonogram At The End|The One with the Sonogram at the End]]\" (mentioned only)\n*\"[[The One With Two Parts, Part 1]]\"\n*\"[[The One With Two Parts, Part 2]]\"\n*\"[[The One With The Jam]]\"\n*\"[[The One With The Jellyfish]]\"\n*\"[[The One With Joey's Bag]]\"\n*\"[[The One Where Chandler Can't Cry]]\"\n*\"[[The One Where They All Turn Thirty]]\"\n*\"[[The One With The Halloween Party]]\"\n*\"[[The One With The Stain]]\" <small>(mentioned only)</small>\n*\"[[The One With The Cake]]\" <small>(mentioned only)</small>\n\n===Mad About You===\n*Married to the Job\n*Natural History\n*It's a Wrap\n*Edna Returns\n*Paul Is Dead\n*The Late Show\n*Virtual Reality\n*Cold Feet\n*The Tape\n*Love Letters\n*Storms We Cannot Weather\n*With This Ring\n*Escape from New York\n*Pandora's Box\n*Once More with Feeling\n*How to Fall in Love\n*Up in Smoke\n*Guardianhood\n*The Magic Pants\n*Fire at Riff's\n*The Thanksgiving Show\n*The Final Frontier: Part 1\n*The Final Frontier: Part 2\n\n==Gallery==\n<gallery orientation=square>\nBitchy.jpg|Phoebe at Ursula's Apartment\nTwins.jpg|Ursula after sleeping with Joey\nFreinds-ursula.png|Ursula dressed for her porn film\nScreen Shot 2015-07-20 at 10.44.12 PM 1.png|Ursula outside after accidentally burning down Riff's\nScreen Shot 2015-07-20 at 10.51.06 PM.png|Ira and Ursula date\nScreen Shot 2015-07-20 at 10.29.45 PM.png|Ursula serving table\n</gallery>\n\n==External links==\n*[http://www.imdb.com/character/ch0029014/ Ursula Buffay] at IMDb\n*[[Wikipedia:Mad About You|Mad About You]] at Wikipedia\n[[Category:Friends Characters]]\n[[Category:Recurring Characters]]\n[[Category:Phoebe's Family]]\n[[Category:Aunts]]\n[[Category:Bullying Characters]]\n[[Category:Joey's relationships]]\n[[Category:Multiple Birth Characters]]\n[[Category:Twins]]\n[[Category:Antagonists]]\n[[Category:Females]]\n[[Category:Season 1 Characters]]\n[[Category:Season 3 Characters]]\n[[Category:Season 4 Characters]]\n[[Category:Season 5 Characters]]\n[[Category:Season 6 Characters]]\n[[Category:Season 7 Characters]]\n[[Category:Season 8 Characters]]\n[[Category:Adopted Characters]]\n[[Category:Characters]]"}}}]}}}}